[
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Helps the user focus by serving as a timer, although recent issues have made it less reliable.",
        "assistive_function_arabic": "يساعد المستخدم على التركيز عن طريق العمل كمؤقت، على الرغم من أن المشكلات الأخيرة جعلته أقل كفاءة.",
        "key_issues": "App reset during a promotional event causing loss of rewards and no customer support response.",
        "key_issues_arabic": "إعادة تعيين التطبيق أثناء حدث ترويجي مما أدى إلى فقدان المكافآت وعدم استجابة خدمة العملاء."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps the user settle down and maintain focus throughout the day as recommended by an AI.",
        "assistive_function_arabic": "يساعد المستخدم على الاسترخاء والحفاظ على التركيز طوال اليوم كما أوصت به الذكاء الاصطناعي.",
        "key_issues": "User received the app through a recommendation and finds it a positive complement to their routine.",
        "key_issues_arabic": "حصل المستخدم على التطبيق بناءً على توصية ويجد أنه إضافة إيجابية لروتينه اليومي."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Acts as a focus aid by blocking distracting applications and supporting study routines.",
        "assistive_function_arabic": "يعمل كأداة للمساعدة على التركيز من خلال حظر التطبيقات المشتتة ولدعم أوقات الدراسة.",
        "key_issues": "The app is praised for custom blocking of distractions, combining with a pomodoro timer; the gamified element (tree death) reinforces focus.",
        "key_issues_arabic": "تم مدح التطبيق لقدرته على تخصيص حظر المشتتات، واستخدامه مع مؤقت بومودورو؛ كما أن العنصر التفاعلي (موت الشجرة) يعزز التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Provides a focus aid by letting users set time intervals and rewarding discipline with growing trees.",
        "assistive_function_arabic": "يوفر أداة للمساعدة على التركيز عبر السماح بتحديد فترات زمنية ومكافأة الانضباط بنمو الأشجار.",
        "key_issues": "The user appreciates the customizable timer and the visual reward system.",
        "key_issues_arabic": "يُعبر المستخدم عن تقديره للعداد القابل للتخصيص ونظام المكافآت البصري."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with studying by transforming focus into a visual progress (growing forest) and motivating long study sessions.",
        "assistive_function_arabic": "يساعد في الدراسة عن طريق تحويل التركيز إلى تقدم بصري (نمو الغابة) وتحفيز جلسات دراسة طويلة.",
        "key_issues": "The app is praised for its transformative effect on focus and productivity, with suggestions for additional features like an iPhone widget and more opportunities to earn trees.",
        "key_issues_arabic": "تم الإشادة بالتطبيق لتأثيره التحويلي على التركيز والإنتاجية، مع اقتراحات لإضافة ميزات مثل ويدجت لهواتف iPhone وفرص إضافية لكسب أشجار."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Intended to aid focus through gamification but ends up distracting due to overemphasis on rewards.",
        "assistive_function_arabic": "كان الهدف منه مساعدة المستخدم على التركيز عبر التفاعلية، ولكنه أصبح مشتتاً بسبب التركيز الزائد على المكافآت.",
        "key_issues": "The reviewer criticizes the app for exploiting the brain's reward system, turning focus into an obsessive and distracting activity with pay-to-play elements.",
        "key_issues_arabic": "ينتقد المراجع التطبيق لاستغلاله نظام المكافآت في الدماغ، مما يحول التركيز إلى نشاط مفرط ومشتت مع عناصر تتطلب الدفع."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Supposed to aid focus, but instead increases stress by emphasizing numerical targets over achievements.",
        "assistive_function_arabic": "من المفترض أن يساعد على التركيز، لكنه بدلاً من ذلك يزيد التوتر من خلال التأكيد على الأرقام بدلًا من الإنجازات.",
        "key_issues": "The app causes stress by focusing on quantitative goals rather than celebrating successes.",
        "key_issues_arabic": "يتسبب التطبيق في توتر المستخدم من خلال التركيز على الأهداف الكمية بدلاً من الاحتفال بالإنجازات."
    },
    {
        "condition_mentioned": "ADHD, Autism",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط، والتوحد",
        "review_score": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps manage neurodivergent symptoms by keeping ADHD in check and supporting focus through gamification.",
        "assistive_function_arabic": "يساعد في التحكم بأعراض عصبية متعددة من خلال إبقاء اضطراب نقص الانتباه تحت السيطرة ودعم التركيز عبر التفاعلية.",
        "key_issues": "The user appreciates the app for helping manage ADHD but is concerned about running out of content (trees) and suggests more customizable features.",
        "key_issues_arabic": "يقدر المستخدم التطبيق لقدرته على إدارة اضطراب نقص الانتباه، لكنه يقلق بشأن نفاد المحتوى (الأشجار) ويقترح ميزات أكثر تخصيصاً."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Aims to support focus but fails due to glitches in event mechanics affecting reward distribution.",
        "assistive_function_arabic": "يهدف إلى دعم التركيز ولكنه يفشل بسبب أخطاء تقنية في آلية الفعاليات التي تؤثر على توزيع المكافآت.",
        "key_issues": "Glitches in the event, failure to grant rewards properly, and continuous loading issues have soured the user's experience.",
        "key_issues_arabic": "أخطاء تقنية في الحدث، وفشل في منح المكافآت بالشكل الصحيح، ومشاكل تحميل مستمرة أضرت بتجربة المستخدم."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Intended as a focus aid but fails as it is outweighed by distractions and poor design.",
        "assistive_function_arabic": "كان من المفترض أن يساعد على التركيز ولكنه يفشل لأنه تطغى عليه المشتتات والتصميم السيء.",
        "key_issues": "The user criticizes the app for being more of a monetized store than a tool to aid focus, mentioning misleading promises, failure to block other apps, and frequent crashes.",
        "key_issues_arabic": "ينتقد المستخدم التطبيق لكونه متجرًا موجهًا لتحقيق الأرباح أكثر من كونه أداة لمساعدة التركيز، مشيراً إلى الوعود المضللة، وفشل التطبيق في حظر التطبيقات الأخرى، والتعطل المتكرر."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps maintain focus and build better habits.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز وبناء عادات أفضل.",
        "key_issues": "The user praises the app for its simplicity, effectiveness, and positive impact on productivity.",
        "key_issues_arabic": "يمدح المستخدم التطبيق لبساطته وفعاليته وتأثيره الإيجابي على الإنتاجية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Supports time management through Pomodoro focus sessions and break timers.",
        "assistive_function_arabic": "يدعم إدارة الوقت عبر جلسات بومودورو مع مؤقتات الاستراحة.",
        "key_issues": "The review highlights that while the app provides a manual break timer and works for Pomodoro sessions, its interface is not intuitive and the Pomodoro feature is not obvious.",
        "key_issues_arabic": "تشير المراجعة إلى أن التطبيق يوفر مؤقت استراحة يدوي ويعمل بطريقة بومودورو، لكن الواجهة ليست بديهية والميزة غير واضحة بما فيه الكفاية."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "review_score": null,
        "assistive_function": "Used as a documentation tool for logging driving hours and other activities.",
        "assistive_function_arabic": "يُستخدم كأداة لتوثيق ساعات القيادة وغيرها من الأنشطة.",
        "key_issues": "The user is stressed and upset because a recent update caused planted trees (records) to vanish, which jeopardizes their documentation needed for progressing towards a driving license.",
        "key_issues_arabic": "المستخدم يشعر بالتوتر والانزعاج لأن التحديث الأخير تسبب في اختفاء الأشجار المزروعة (السجلات)، مما يعرض توثيق الساعات الضرورية للحصول على رخصة القيادة للخطر."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps reduce phone distraction by forcing the user to pause and refocus.",
        "assistive_function_arabic": "يساعد في تقليل التشتيت الناتج عن الهاتف عن طريق إجبار المستخدم على التوقف وإعادة التركيز.",
        "key_issues": "The review highly praises the app for improving life quality by encouraging mindful phone usage and facilitating a more positive focus.",
        "key_issues_arabic": "تمتدح المراجعة التطبيق بشكل كبير لتحسين جودة الحياة من خلال تشجيع استخدام الهاتف بوعي وتعزيز التركيز الإيجابي."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Assists in maintaining concentrated study sessions and managing online class distractions using deep focus mode.",
        "assistive_function_arabic": "يساعد في الحفاظ على جلسات دراسة مركزة وإدارة مشتتات الحصص الدراسية عبر وضع التركيز العميق.",
        "key_issues": "The user appreciates the customizable timer and focus mode for school, along with the visual satisfaction provided by a healthy forest representation.",
        "key_issues_arabic": "يُثمن المستخدم المؤقت المخصص ووضع التركيز المستخدم للدراسة، إلى جانب المتعة البصرية التي يقدمها تمثيل الغابة الصحية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Enhances personal focus by providing a visually appealing and engaging interface.",
        "assistive_function_arabic": "يعزز التركيز الشخصي من خلال توفير واجهة جذابة بصريًا وتفاعلية.",
        "key_issues": "The user simply expresses love for the app, mentioning cute trees and improved focus.",
        "key_issues_arabic": "يعبر المستخدم ببساطة عن حبه للتطبيق، مشيراً إلى جمال الأشجار وتحسن التركيز."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Aids in maintaining focus and prompting regular breaks.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز وتذكير المستخدم بأخذ فترات للراحة.",
        "key_issues": "The reviewer praises the app for being an effective tool for people with ADHD by providing reminders to focus on one task and take breaks, with an added element of cuteness.",
        "key_issues_arabic": "يمدح المراجع التطبيق كأداة فعالة للأشخاص الذين يعانون من ADHD من خلال تقديم تذكيرات بالتركيز على مهمة واحدة وأخذ فترات راحة، مع لمسة من الجاذبية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps prevent mindless app refreshing and reduces compulsive doomscrolling.",
        "assistive_function_arabic": "يساعد في منع إعادة فتح التطبيقات بلا وعي وتقليل تصفح المحتوى المفرط السلبي.",
        "key_issues": "The user appreciates how the app redirects their attention from endless scrolling and helps maintain a more productive focus.",
        "key_issues_arabic": "يعبر المستخدم عن تقديره لكيفية إعادة توجيه التطبيق لانتباهه بعيداً عن التصفح اللا متناهي والمساعدة في الحفاظ على تركيز أكثر إنتاجية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Supports time management by enhancing focus during work.",
        "assistive_function_arabic": "يدعم إدارة الوقت من خلال تعزيز التركيز أثناء العمل.",
        "key_issues": "The review commends the app for superior focus enhancement compared to other time management apps, allowing the user to work without noticing the passage of time.",
        "key_issues_arabic": "يمدح المستخدم التطبيق لقوته في تحسين التركيز مقارنة بتطبيقات إدارة الوقت الأخرى، مما يجعله يعمل دون أن يشعر بمرور الوقت."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Facilitates focused study sessions with customizable settings and progress tracking.",
        "assistive_function_arabic": "يسهل جلسات الدراسة المركزة مع إعدادات قابلة للتخصيص وتتبع للتقدم.",
        "key_issues": "The user is impressed by the app’s ad-free experience, customizable deep focus settings, variety of visual themes, and even the innovative option to plant real trees with earned coins alongside detailed statistics.",
        "key_issues_arabic": "أُعجب المستخدم بخلو التطبيق من الإعلانات، وإمكانيات التخصيص لوضع التركيز العميق، وتنوع السمات البصرية، وخيار زرع الأشجار الحقيقية باستخدام العملات المكتسبة بالإضافة إلى الإحصائيات التفصيلية."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with focus",
        "assistive_function_arabic": "يساعد في التركيز",
        "key_issues": "The app is described as fun and helpful, enabling the user to focus despite ADHD.",
        "key_issues_arabic": "يُوصف التطبيق بأنه ممتع ومفيد، مما يمكّن المستخدم من التركيز على الرغم من اضطراب نقص الانتباه مع فرط النشاط."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Used for study focus and mindfulness",
        "assistive_function_arabic": "يستخدم للدراسة والتركيز الذهني",
        "key_issues": "The user appreciates the app for aiding focus during MCAT studies and mindfulness practice.",
        "key_issues_arabic": "يُقدِّم المستخدم شكره للتطبيق الذي يساعده على التركيز أثناء التحضير لامتحان MCAT وممارسة التأمل."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Helps with focus",
        "assistive_function_arabic": "يساعد في التركيز",
        "key_issues": "Unexpected deletion of user data, purchased add-ons, and records caused major disappointment and distrust.",
        "key_issues_arabic": "حذف غير متوقع لبيانات المستخدم والإضافات والمشتريات تسبب بخيبة أمل كبيرة وفقدان الثقة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "assistive_function": "Used for focus",
        "assistive_function_arabic": "يُستخدم للتركيز",
        "key_issues": "While the user loves the app, persistent bugs with widgets and focus settings undermine its functionality.",
        "key_issues_arabic": "على الرغم من إعجاب المستخدم بالتطبيق، إلا أن الأخطاء المستمرة في الودجات وإعدادات التركيز تؤثر على أدائه."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "assistive_function": "Used for productivity and focus",
        "assistive_function_arabic": "يستخدم للإنتاجية والتركيز",
        "key_issues": "Long-standing user frustrated by recent bugs in Focus Challenges causing delays and reducing productivity.",
        "key_issues_arabic": "مستخدم قديم محبط بسبب الأخطاء الأخيرة في تحديات التركيز التي تتسبب في تأخيرات وتقلل من الإنتاجية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Motivates focus",
        "assistive_function_arabic": "يشجع على التركيز",
        "key_issues": "The app is seen as cute and fun, which encourages the user to focus.",
        "key_issues_arabic": "يُنظر إلى التطبيق على أنه لطيف وممتع مما يشجع المستخدم على التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Used for monk mode focus and mindfulness",
        "assistive_function_arabic": "يستخدم لنمط التركيز الرهباني والتأمل",
        "key_issues": "Highly praised for its focus features and the unique gamified element of planting real trees through building a virtual forest.",
        "key_issues_arabic": "يحظى بإشادة كبيرة لميزات التركيز والعنصر الفريد في اللعبة الذي يربط زراعة الأشجار الحقيقية ببناء غابة افتراضية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Assists in focusing",
        "assistive_function_arabic": "يساعد في التركيز",
        "key_issues": "The app works well most of the time and the developer is responsive to occasional issues.",
        "key_issues_arabic": "يعمل التطبيق بشكل جيد معظم الوقت والمطور يستجيب للمشاكل النادرة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Improves productivity and focus",
        "assistive_function_arabic": "يحسن الإنتاجية والتركيز",
        "key_issues": "The app is credited with increasing productivity through improved focus and flexible usage options.",
        "key_issues_arabic": "يعزو المستخدم زيادة الإنتاجية إلى تحسين التركيز وخيارات الاستخدام المرنة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "review_score": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with study focus",
        "assistive_function_arabic": "يساعد في التركيز على الدراسة",
        "key_issues": "The app is appreciated for helping the user concentrate on studies.",
        "key_issues_arabic": "يُقدَّر التطبيق لمساعدة المستخدم على التركيز أثناء الدراسة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps the user stay focused and track work.",
        "assistive_function_arabic": "يساعد المستخدم على التركيز وتتبع الأعمال.",
        "key_issues": "The reviewer praises the tool for enhancing focus and notes that although there are many extra features that may seem unnecessary, they are still very helpful.",
        "key_issues_arabic": "يمدح المراجع الأداة لتحسين التركيز، ويشير إلى أنه بالرغم من وجود ميزات إضافية قد تبدو غير ضرورية، إلا أنها مفيدة للغاية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps maintain focus during tasks and manages allowed distractions.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز أثناء أداء المهام ويدير المشتتات المسموح بها.",
        "key_issues": "The reviewer loves the gamified focus features like planting trees and a count up timer, but experiences crashes when using the allow list, and suggests improvements such as mid-session changes and pause options.",
        "key_issues_arabic": "يحب المراجع الميزات المفعمة بالألعاب مثل زراعة الأشجار والمؤقت التصاعدي، لكنه يواجه مشاكل في تجميد التطبيق عند استخدام قائمة السماح، ويقترح تحسينات مثل إمكانية التغيير خلال الجلسة وخيار التوقف المؤقت."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Helps track study or work sessions using tags.",
        "assistive_function_arabic": "يساعد في تتبع جلسات الدراسة أو العمل باستخدام العلامات.",
        "key_issues": "The user reports a frustrating bug where tags get renamed, incremented, or deleted automatically, making task tracking feel pointless.",
        "key_issues_arabic": "يشير المستخدم إلى وجود خلل محبط يتم فيه إعادة تسمية العلامات أو ترقيمها أو حذفها تلقائيًا، مما يجعل تتبع المهام بلا جدوى."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Serves as a focus aid that contributed to academic and life success.",
        "assistive_function_arabic": "يعمل كأداة مساعدة للتركيز ساهمت في النجاح الأكاديمي والحياتي.",
        "key_issues": "While the app has been life changing and extremely helpful in focusing (even contributing to academic achievements), the shift to a subscription model has disappointed the reviewer.",
        "key_issues_arabic": "على الرغم من أن التطبيق كان مغيراً للحياة وساعد على التركيز وساهم في الإنجازات الأكاديمية، إلا أن التحول إلى نموذج الاشتراك خيب آمال المراجع."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps in sustaining focus through engaging gamified elements.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز من خلال عناصر الألعاب التفاعلية.",
        "key_issues": "The user appreciates the visual appeal and the focus benefits, though they are still learning the app.",
        "key_issues_arabic": "يُقدّر المستخدم جاذبية التطبيق وفوائده في تعزيز التركيز، رغم أنه لا يزال في مرحلة التعلم."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Aims to aid focus via challenge-based tasks.",
        "assistive_function_arabic": "يهدف إلى مساعدة المستخدم على التركيز من خلال مهام التحدي.",
        "key_issues": "The reviewer experiences persistent bugs within the Focus Challenges section that prevent awards from being logged, leading to significant frustration and consideration of deleting the app.",
        "key_issues_arabic": "يعاني المراجع من أخطاء متكررة في قسم تحديات التركيز تمنع تسجيل الجوائز، مما يؤدي إلى إحباط شديد ويفكر بحذف التطبيق."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Supports focused study sessions through a tree-growing feature.",
        "assistive_function_arabic": "يدعم جلسات الدراسة المركزة من خلال ميزة زراعة الأشجار.",
        "key_issues": "While the tree-growing function during study is appreciated, frequent bugs specifically in the focus challenges reduce the overall experience.",
        "key_issues_arabic": "على الرغم من تقدير وظيفة زراعة الأشجار أثناء الدراسة، إلا أن الأخطاء المتكررة في تحديات التركيز تقلل من جودة التجربة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Designed to assist with focus challenges and tracking accomplishments.",
        "assistive_function_arabic": "مصمم للمساعدة في تحديات التركيز وتتبع الإنجازات.",
        "key_issues": "The focus challenge page crashed, resulting in a loss of logged accomplishments, which greatly frustrates the user.",
        "key_issues_arabic": "تعرّضت صفحة تحديات التركيز للتعطل مما أدى إلى فقدان تسجيل الإنجازات، وهذا الأمر أربك المراجع بشدة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Intended to motivate focus through task-based challenges.",
        "assistive_function_arabic": "مصمم لتحفيز التركيز من خلال التحديات القائمة على المهام.",
        "key_issues": "The reviewer finds the focus challenge overly flawed—comparing it to psychological torture—as rewards fail to update, making the experience both embarrassing and distressing, ultimately leading to a decision to delete the app.",
        "key_issues_arabic": "يعتبر المراجع تحدي التركيز معيباً للغاية – مشبهاً ذلك بالتعذيب النفسي – حيث لا يتم تحديث المكافآت، مما يجعل التجربة محبطة ومحرجة، وفي نهاية المطاف قرر حذف التطبيق."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Enhances reading engagement and focus through its gamified tree planting concept.",
        "assistive_function_arabic": "يعزز من تفاعل القارئ وتركيزه من خلال مفهوم زراعة الأشجار كلعبة تحفيزية.",
        "key_issues": "The reviewer discovered the app while seeking ways to make reading more engaging and finds the concept both cute and effective in sparking a desire to read.",
        "key_issues_arabic": "اكتشف المراجع التطبيق أثناء بحثه عن طرق لجعل القراءة أكثر إثارة، ويجد المفهوم لطيفاً وفعالاً في تحفيز الرغبة في القراءة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps maintain focus during work by locking distracting apps.",
        "assistive_function_arabic": "يساعد على الحفاظ على التركيز أثناء العمل عن طريق قفل التطبيقات المشتتة.",
        "key_issues": "The app is praised for its focus-enhancing feature, particularly the ability to lock other apps during a focus session.",
        "key_issues_arabic": "يُثنى على التطبيق لميزته المحفزة للتركيز، خاصةً القدرة على قفل التطبيقات الأخرى أثناء جلسة التركيز."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps manage focus and productivity, especially for users with ADHD.",
        "assistive_function_arabic": "يساعد في إدارة التركيز والإنتاجية، وخاصة للمستخدمين الذين يعانون من اضطراب نقص الانتباه مع فرط النشاط.",
        "key_issues": "The app is appreciated for helping with focus, particularly in a demanding STEM environment.",
        "key_issues_arabic": "يُثنى التطبيق لمساعدته في تحسين التركيز، خاصةً في بيئة STEM المتطلبة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps maintain focus through gamified challenges and tree-planting features.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز من خلال التحديات الترفيهية وميزات زراعة الأشجار.",
        "key_issues": "While the gamified aspects (trees, events, focus challenge) are well-liked, the user experiences glitches with challenges and the allow list functionality.",
        "key_issues_arabic": "في حين أن الجوانب الترفيهية مثل الأشجار والأحداث وتحدي التركيز محببة، يواجه المستخدم خللاً تقنيًا في التحديات ووظيفة القائمة المسموح بها."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Enhances focus effectively.",
        "assistive_function_arabic": "يعزز التركيز بفعالية.",
        "key_issues": "The app is praised for its effectiveness in helping the user stay focused.",
        "key_issues_arabic": "يُثنى التطبيق على فعاليته في مساعدة المستخدم على الحفاظ على التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps in focusing and completing tasks efficiently.",
        "assistive_function_arabic": "يساعد في التركيز وإتمام المهام بكفاءة.",
        "key_issues": "Described as a life changer, the app is highly effective for focus despite the reviewer’s struggle with a low attention span.",
        "key_issues_arabic": "يُوصف التطبيق بأنه مغير للحياة وفعال للغاية في تحسين التركيز، رغم معاناة المستخدم من قلة مدة الانتباه."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Used for enhancing deep focus by locking distracting apps through whitelist and deep focus modes.",
        "assistive_function_arabic": "يُستخدم لتعزيز التركيز العميق عن طريق قفل التطبيقات المشتتة باستخدام القائمة البيضاء ووضع التركيز العميق.",
        "key_issues": "The user loves the app overall but reports significant technical issues with the whitelist and Deep Focus functionalities, causing screen blanks and other glitches.",
        "key_issues_arabic": "يحب المستخدم التطبيق بشكل عام، لكنه يُبلغ عن مشاكل تقنية كبيرة مع وظائف القائمة البيضاء ووضع التركيز العميق، مما يؤدي إلى ظهور شاشة سوداء وغيرها من الأعطال."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Acts as a focus aid that organizes attention through a visual garden metaphor.",
        "assistive_function_arabic": "يعمل كأداة لتركيز الانتباه من خلال استعارة بصرية تشبه الحديقة.",
        "key_issues": "The reviewer suggests adding improved visualization and gamification features to better track focus time by category.",
        "key_issues_arabic": "يقترح المستخدم إضافة ميزات تصور وعناصر ألعاب لتحسين تتبع وقت التركيز حسب الفئات."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Assists in focus and reducing phone usage, which is especially valuable for those with ADHD in an educational context.",
        "assistive_function_arabic": "يساعد في تحسين التركيز وتقليل استخدام الهاتف، وهو مفيد بشكل خاص للأشخاص الذين يعانون من اضطراب نقص الانتباه مع فرط النشاط في البيئات التعليمية.",
        "key_issues": "The app is celebrated for its engaging features like new tree species and focus challenges, making it an effective tool for ADHD users.",
        "key_issues_arabic": "يُثنى التطبيق على ميزاته الجذابة مثل إضافة أنواع جديدة من الأشجار وتحديات التركيز، مما يجعله أداة فعالة للمستخدمين الذين يعانون من اضطراب نقص الانتباه مع فرط النشاط."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Enhances focus and productivity during task completion.",
        "assistive_function_arabic": "يعزز التركيز والإنتاجية أثناء إتمام المهام.",
        "key_issues": "While the app is highly effective at aiding focus and productivity, the reviewer wishes for longer focus session durations.",
        "key_issues_arabic": "على الرغم من فعالية التطبيق في تحسين التركيز والإنتاجية، يتمنى المستخدم أن تكون مدة جلسات التركيز أطول."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Serves as a productivity aid by encouraging sustained focus and discouraging distractions.",
        "assistive_function_arabic": "يعمل كأداة لتحسين الإنتاجية من خلال تشجيع التركيز المستمر والحد من المشتتات.",
        "key_issues": "The app is highly valued for its positive impact on productivity, though there is some uncertainty regarding the new subscription model.",
        "key_issues_arabic": "يُقدر التطبيق بشدة لتأثيره الإيجابي على الإنتاجية، على الرغم من وجود بعض الشكوك بشأن نموذج الاشتراك الجديد."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with focus and managing life transitions.",
        "assistive_function_arabic": "يساعد في التركيز وإدارة انتقالات الحياة.",
        "key_issues": "The app is praised for helping overcome ADHD freeze mode and depression, boosting productivity and motivation.",
        "key_issues_arabic": "يُشاد بالتطبيق لمساعدته على تجاوز حالة تجميد ADHD والاكتئاب وزيادة الإنتاجية والتحفيز."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps with productivity and managing ADHD symptoms.",
        "assistive_function_arabic": "يساعد في زيادة الإنتاجية وإدارة أعراض ADHD.",
        "key_issues": "Longtime user experiences significant data loss and no response from support, despite the app’s role in improving focus.",
        "key_issues_arabic": "يواجه المستخدم الذي استخدم التطبيق لسنوات فقدان بيانات كبير وعدم استجابة من الدعم، على الرغم من دوره في تحسين التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "neutral",
        "review_score": null,
        "sentiment_arabic": "محايد",
        "assistive_function": "Used to maintain daily productivity and motivation.",
        "assistive_function_arabic": "يستخدم للحفاظ على الإنتاجية اليومية والتحفيز.",
        "key_issues": "Requested additional monthly focus challenges to enhance user engagement.",
        "key_issues_arabic": "طلب تحديات شهرية إضافية لتعزيز تفاعل المستخدمين."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Enhances focus and study routines through visual progress tracking and challenges.",
        "assistive_function_arabic": "يعزز التركيز وروتين الدراسة من خلال تتبع التقدم بصرياً والتحديات.",
        "key_issues": "The user praises the app for dramatically increasing focus duration and for its widget and challenge features, even though the ADHD tendencies are self-reported.",
        "key_issues_arabic": "يمتدح المستخدم التطبيق لزيادة مدة التركيز بشكل كبير ولميزات الودجت والتحديات مع الإشارة إلى أن ميوله لـ ADHD غير مُشخّصة رسمياً."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps to avoid doomscrolling and maintain focus on important tasks.",
        "assistive_function_arabic": "يساعد في تجنب التصفح المفرط والحفاظ على التركيز على المهام المهمة.",
        "key_issues": "Praised for its effective gamification that deters distractions.",
        "key_issues_arabic": "يُشاد به لأسلوب الألعاب الفعّال الذي يمنع التشتت."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Used for deep focus mode by managing allowed apps.",
        "assistive_function_arabic": "يُستخدم لوضع التركيز العميق من خلال إدارة التطبيقات المسموح بها.",
        "key_issues": "The app freezes when displaying the allowed app list, hindering effective use of deep focus mode.",
        "key_issues_arabic": "يتجمد التطبيق عند عرض قائمة التطبيقات المسموح بها، مما يعيق الاستخدام الفعال لوضع التركيز العميق."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with time blocking and tracking time as a focus aid.",
        "assistive_function_arabic": "يساعد في تقسيم الوقت وتتبع الوقت كمساعد للتركيز.",
        "key_issues": "Praised for its rewarding time tracking and efficiency in time blocking.",
        "key_issues_arabic": "يُشاد به لنظام مكافآت تتبع الوقت وفعاليته في تقسيم الوقت."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps maintain focus using gentle reminders and gamified forest planting.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز من خلال التذكيرات اللطيفة وزراعة الغابات بنمط الألعاب.",
        "key_issues": "Praised for being fun and engaging with its gentle reminders and appealing visual design.",
        "key_issues_arabic": "يُشاد به لكونه ممتعاً وجذاباً من خلال التذكيرات اللطيفة والتصميم البصري الجذاب."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Enhances focus and productivity to manage a heavy workload.",
        "assistive_function_arabic": "يعزز التركيز والإنتاجية لإدارة عبء العمل الثقيل.",
        "key_issues": "Highly praised for significantly increasing productivity despite severe ADHD symptoms.",
        "key_issues_arabic": "يُشاد به بشكل كبير لزيادة الإنتاجية بشكل ملحوظ على الرغم من حدة أعراض ADHD."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Aids in balancing focus and reminds to take periodic breaks.",
        "assistive_function_arabic": "يساعد في تحقيق توازن التركيز ويذكر بأخذ فترات راحة دورية.",
        "key_issues": "The gamification helps mitigate mindless scrolling and promotes a balanced focus during work.",
        "key_issues_arabic": "يساعد نمط الألعاب في التطبيق على تقليل التصفح المفرط وتشجيع التوازن في التركيز أثناء العمل."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps improve focus with app blocking and progress tracking through tree planting.",
        "assistive_function_arabic": "يساعد على تحسين التركيز من خلال حظر التطبيقات وتتبع التقدم عبر زراعة الأشجار.",
        "key_issues": "Praised for its clean and calming interface, effective app blocking, and innovative tree-planting progress tracker; noted as a better alternative to competitors with subscriptions.",
        "key_issues_arabic": "يُشاد بالتطبيق لواجهة نظيفة وهادئة، وقدرته على حظر التطبيقات، ونظام تتبع التقدم عبر زراعة الأشجار؛ ويُعتبر بديلاً أفضل من التطبيقات التي تعتمد على الاشتراكات."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps maintain focus for studying religious texts and preparing for meetings.",
        "assistive_function_arabic": "يساعد على الحفاظ على التركيز لدراسة النصوص الدينية والتحضير للاجتماعات.",
        "key_issues": "The user finds the app fun and motivating for study sessions.",
        "key_issues_arabic": "يجد المستخدم أن التطبيق ممتع ومحفّز لجلسات الدراسة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Serves primarily as a focus aid.",
        "assistive_function_arabic": "يعمل بشكل أساسي كأداة مساعدة للتركيز.",
        "key_issues": "The app is credited with effectively helping the user focus.",
        "key_issues_arabic": "يُشاد بالتطبيق لقدراته على مساعدة المستخدم في التركيز بشكل فعّال."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Assists with focus during long creative tasks like novel writing.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز أثناء المهام الإبداعية الطويلة مثل كتابة الروايات.",
        "key_issues": "The user praises the simple design and engaging focus challenges, noting significant personal improvement.",
        "key_issues_arabic": "يمتدح المستخدم التصميم البسيط وتحديات التركيز المشوقة، مع ملاحظة تحسن شخصي واضح."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Enhances focus through gamified challenges and reward mechanics.",
        "assistive_function_arabic": "يعزز التركيز من خلال تحديات محفزة وآليات مكافأة ملهمة.",
        "key_issues": "Highly motivating due to the focus challenges and rewards, yet the user wishes for improved options to sort trees (e.g., by type or alphabetically).",
        "key_issues_arabic": "يحفّز التطبيق المستخدم بفضل تحديات التركيز والمكافآت، لكنه يرغب في خيارات أفضل لتصنيف الأشجار (مثلًا بحسب النوع أو الترتيب الأبجدي)."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps reduce phone usage and maintain focus on hobbies through challenge-based gameplay.",
        "assistive_function_arabic": "يساعد على تقليل استخدام الهاتف والتركيز على الهوايات من خلال أسلوب اللعب المعتمد على التحديات.",
        "key_issues": "The user appreciates the simple, cute design and the clear, no-cheats monetization model that motivates focus.",
        "key_issues_arabic": "يُقدّر المستخدم التصميم البسيط والظريف، ونموذج الدفع الواضح الذي لا يعتمد على الغش لتحفيز التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Motivates focus and reinforces productivity after completing tasks.",
        "assistive_function_arabic": "يحافظ على الدافع ويعزز الإنتاجية بعد إنجاز المهام.",
        "key_issues": "The application is recognized for its motivational quality and focus-enhancing capabilities.",
        "key_issues_arabic": "يُلاحظ أن التطبيق محفز وفعال في تعزيز التركيز والإنتاجية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Acts as a focus and motivation aid despite occasional technical glitches.",
        "assistive_function_arabic": "يعمل كمساعدة للتركيز والتحفيز على الرغم من بعض الأعطال التقنية.",
        "key_issues": "While bugs are present, the overall functionality that supports focus and motivation is appreciated.",
        "key_issues_arabic": "على الرغم من وجود بعض الأخطاء، يُقدّر التطبيق لقدراته على دعم التركيز والتحفيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "review_score": null,
        "assistive_function": "Intended to block distractions and maintain focus, but fails in execution.",
        "assistive_function_arabic": "يهدف إلى حظر المشتتات والحفاظ على التركيز، لكنه يفشل في تنفيذه بالشكل المطلوب.",
        "key_issues": "The app fails to block other applications, leading to an inaccurate focus streak, and customer support was unresponsive.",
        "key_issues_arabic": "يفشل التطبيق في حظر التطبيقات الأخرى، مما يؤدي إلى عداد تركيز غير دقيق، وكان الدعم الفني غير متجاوب."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "review_score": null,
        "assistive_function": "Relies on focus challenges to drive productivity, which are currently impaired.",
        "assistive_function_arabic": "يعتمد على تحديات التركيز لتعزيز الإنتاجية، وهي حالياً تعاني من مشاكل.",
        "key_issues": "Persistent bugs were reported, especially with the focus challenge not loading completely after an update.",
        "key_issues_arabic": "تم الإبلاغ عن أخطاء مستمرة، خاصة مع عدم تحميل تحدي التركيز بشكل كامل بعد التحديث."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps with focus.",
        "assistive_function_arabic": "يساعد في التركيز.",
        "key_issues": "App is praised for helping focus, but the user wishes for more personalization options.",
        "key_issues_arabic": "يثني المستخدم على التطبيق لمساعدته على التركيز ولكنه يتمنى وجود المزيد من خيارات التخصيص."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Helps with focus.",
        "assistive_function_arabic": "يساعد في التركيز.",
        "key_issues": "User loves the app but complains about frequent crashes and issues exiting focus mode, rendering the app unusable.",
        "key_issues_arabic": "يحب المستخدم التطبيق ولكنه يشتكي من الأعطال المتكررة ومشاكل الخروج من وضع التركيز، مما يجعل التطبيق غير قابل للاستخدام."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Helps improve focus and build good habits.",
        "assistive_function_arabic": "يساعد على تحسين التركيز وبناء عادات جيدة.",
        "key_issues": "User is upset about the introduction of AI features, the subscription model, added complexity, and persistent bugs. They feel that these changes conflict with the app’s core values.",
        "key_issues_arabic": "يشعر المستخدم بالاستياء من إضافة ميزات الذكاء الاصطناعي ونموذج الاشتراك، بالإضافة إلى التعقيد المتزايد والأخطاء المستمرة. ويعتقد أن هذه التغييرات تتعارض مع القيم الأساسية للتطبيق."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Tracks focus on projects.",
        "assistive_function_arabic": "يعقب التركيز على المشاريع.",
        "key_issues": "User finds the app entertaining and useful for tracking focus.",
        "key_issues_arabic": "يجد المستخدم التطبيق مسلياً ومفيداً في تتبع التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with focus.",
        "assistive_function_arabic": "يساعد في التركيز.",
        "key_issues": "User finds the app helpful and cute for staying focused.",
        "key_issues_arabic": "يجد المستخدم التطبيق مفيداً وظريفاً للمساعدة في التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps stay focused and tracks productivity.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز ويتعقب الإنتاجية.",
        "key_issues": "User praises the app for its focus aid and productivity stats but criticizes recurring bugs such as freezing and malfunctioning features.",
        "key_issues_arabic": "يمتدح المستخدم التطبيق لمساعدته على التركيز وتعقب الإنتاجية ولكنه ينتقد الأخطاء المتكررة مثل التجمد وتعطل بعض الميزات."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps with focus at work and study.",
        "assistive_function_arabic": "يساعد في التركيز في العمل والدراسة.",
        "key_issues": "User appreciates the app's focus aid and unique features, but experienced data loss due to glitches and the absence of account creation.",
        "key_issues_arabic": "يثمن المستخدم التطبيق لمساعدته على التركيز وميزاته الفريدة، لكنه تعرض لفقدان البيانات بسبب الأعطال وعدم إنشاء حساب."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps in maintaining focus and achieving goals.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز وتحقيق الأهداف.",
        "key_issues": "User praises the app for its rewarding focus features but is disappointed about the upcoming subscription requirement.",
        "key_issues_arabic": "يثني المستخدم على الميزات المحفزة للتركيز في التطبيق ولكنه يشعر بخيبة أمل بسبب الاشتراك القادم."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps stay focused.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز.",
        "key_issues": "User simply loves the app for its effectiveness in aiding focus.",
        "key_issues_arabic": "يحب المستخدم التطبيق ببساطة لما يقدمه من فاعلية في مساعدة التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps with focus and offers gamified environmental features.",
        "assistive_function_arabic": "يساعد في التركيز ويوفر ميزات ترفيهية بيئية.",
        "key_issues": "User commends the app for its long-term performance, recent updates including lofi music, and varied features such as planting real trees.",
        "key_issues_arabic": "يثني المستخدم على أداء التطبيق على المدى الطويل، والتحديثات الأخيرة بما في ذلك موسيقى اللوفاي، والميزات المتنوعة مثل زراعة الأشجار الحقيقية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus timer",
        "assistive_function_arabic": "مؤقت التركيز",
        "key_issues": "The reviewer praises the app as their long‐term go-to focus timer and loves using it across devices.",
        "key_issues_arabic": "يمدح المراجع التطبيق كمؤقت تركيز يعتمد عليه على المدى الطويل ويستخدمه عبر الأجهزة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus reminder",
        "assistive_function_arabic": "تذكير بالتركيز",
        "key_issues": "The reviewer likens the app's persistent prompting to a memorable voice from Star Wars, which helps them stay on target.",
        "key_issues_arabic": "يقارن المراجع تذكير التطبيق الصوتي بصوت مأثور من حرب النجوم مما يساعده على البقاء مركزاً."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "review_score": null,
        "assistive_function": "Focus aid",
        "assistive_function_arabic": "مساعد على التركيز",
        "key_issues": "The reviewer reports several glitches: issues with coin multipliers, unexpected app closures, clock display problems, and inconsistent timer resets.",
        "key_issues_arabic": "يشير المراجع إلى عدة أخطاء تقنية مثل مشاكل مضاعفة العملات، وإغلاق التطبيق بشكل غير متوقع، ومشاكل في عرض الساعة وعدم انتظام إعادة تشغيل المؤقت."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Phone usage control and focus aid",
        "assistive_function_arabic": "التحكم باستخدام الهاتف وتوفير التركيز",
        "key_issues": "The reviewer appreciates that the app helps them stay off their phone and remain focused.",
        "key_issues_arabic": "يعبر المراجع عن تقديره للتطبيق الذي يساعده على الابتعاد عن الهاتف والتركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid",
        "assistive_function_arabic": "مساعد على التركيز",
        "key_issues": "The reviewer praises the app’s calming, aesthetic, and motivating design, which has significantly improved their focus over three years.",
        "key_issues_arabic": "يمدح المراجع التصميم الجمالي والمهدئ والمحفز للتطبيق الذي ساعده بشكل ملحوظ على تحسين تركيزه على مدى ثلاث سنوات."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Focus enhancer",
        "assistive_function_arabic": "محفز التركيز",
        "key_issues": "While the reviewer appreciates that the app has helped them focus for almost 600 hours this year, they also mention performance issues like unexpected shutdowns and slow response times.",
        "key_issues_arabic": "على الرغم من أن المراجع يثمن مساعدتها في التركيز لما يقارب 600 ساعة هذا العام، إلا أنه يشير إلى مشاكل في الأداء مثل الإغلاق المفاجئ وبطء الاستجابة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Focus aid",
        "assistive_function_arabic": "مساعد على التركيز",
        "key_issues": "The reviewer highlights pros like effective focus and gamification, but criticizes issues such as incompatibility with automation shortcuts, lack of support communication, and the absence of a 12-hour clock display.",
        "key_issues_arabic": "يشير المراجع إلى إيجابيات مثل تعزيز التركيز واللعب، لكنه ينتقد مشاكل مثل عدم التوافق مع اختصارات الأتمتة، وقلة تواصل الدعم الفني، وعدم وجود عرض للساعة بنظام 12 ساعة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Phone usage control and focus aid",
        "assistive_function_arabic": "التحكم باستخدام الهاتف ومساعد على التركيز",
        "key_issues": "The reviewer appreciates the app’s ability to block excessive phone use and improve focus, productivity, and bedtime, although they mention occasional bugs like loading and refreshing issues.",
        "key_issues_arabic": "يعبر المراجع عن تقديره لقدرة التطبيق على الحد من الاستخدام المفرط للهاتف وتحسين التركيز والإنتاجية وأوقات النوم، رغم وجود بعض المشاكل العرضية في التحميل والتحديث."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid and daily productivity",
        "assistive_function_arabic": "مساعد على التركيز والإنتاجية اليومية",
        "key_issues": "The reviewer loves the app for transforming their focus from merely reducing screen time to making the most of their day, calling it life-altering and praising its clever design.",
        "key_issues_arabic": "يُعبر المراجع عن حبه للتطبيق الذي حول تركيزه من مجرد تقليل وقت الشاشة إلى استثمار اليوم بأفضل شكل، واصفًا إياه بأنه مغير للحياة وبأنه ذو تصميم ذكي."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid",
        "assistive_function_arabic": "مساعد على التركيز",
        "key_issues": "The reviewer simply praises the app, calling it the best for staying focused and expressing clear enjoyment.",
        "key_issues_arabic": "يبدي المراجع مدحه البسيط للتطبيق ويعتبره الأفضل للبقاء مركزاً معبراً عن إعجابه الشديد."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Focus tracking and forest growth management used as a productivity aid.",
        "assistive_function_arabic": "يساعد على تتبع التركيز وإدارة نمو الغابة لتعزيز الإنتاجية.",
        "key_issues": "The app is very buggy: the focus challenge won’t load, timers won’t start or stop, sign-in errors occur repeatedly, and there is a fear of losing saved trees.",
        "key_issues_arabic": "التطبيق مليء بالأخطاء: لا يتم تحميل تحدي التركيز، ولا تعمل المؤقتات، ومشاكل متكررة في تسجيل الدخول، وهناك خوف من فقدان الأشجار المحفوظة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Simple focus tracking to monitor productivity.",
        "assistive_function_arabic": "يساعد على تتبع التركيز ببساطة لمراقبة الإنتاجية.",
        "key_issues": "New features fail to load and the ‘Seekr’ login function doesn’t work, making it a frustrating experience when all the user wants is basic focus tracking.",
        "key_issues_arabic": "المميزات الجديدة لا تعمل ووظيفة تسجيل الدخول عبر 'Seekr' معطلة، مما يسبب إحباطاً لدى المستخدم الذي يريد تتبع التركيز الأساسي فقط."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Focus challenge feature intended to improve productivity.",
        "assistive_function_arabic": "ميزة تحدي التركيز المصممة لتحسين الإنتاجية.",
        "key_issues": "The focus challenge never loads and there is no support from the developers, leading the user to seek an alternative app.",
        "key_issues_arabic": "تحدي التركيز لا يتم تحميله ولا يوجد دعم من المطورين، مما يدفع المستخدم للبحث عن تطبيق بديل."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid that helps with concentration and habit building.",
        "assistive_function_arabic": "يساعد في التركيز وبناء العادات.",
        "key_issues": "The user praises the app for improving concentration with its cute design and tree planting rewards, and appreciates the habit-forming benefits.",
        "key_issues_arabic": "يثمن المستخدم التطبيق لتحسين التركيز مع التصميم اللطيف ومكافآت زراعة الأشجار، ويقدر الفوائد في بناء العادات."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Enhances productivity and makes work fun by tracking focus.",
        "assistive_function_arabic": "يعزز الإنتاجية ويجعل العمل ممتعاً من خلال تتبع التركيز.",
        "key_issues": "Highly positive feedback highlighting the app as the best for productivity and having fun while working.",
        "key_issues_arabic": "تعليق إيجابي للغاية يشير إلى أن التطبيق هو الأفضل لتعزيز الإنتاجية والاستمتاع أثناء العمل."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Deep focus mode intended to block distracting apps.",
        "assistive_function_arabic": "وضع تركيز عميق موضع لمنع التطبيقات المشتتة.",
        "key_issues": "Despite paying for the app, the deep focus mode fails to block other apps, rendering the core function useless.",
        "key_issues_arabic": "على الرغم من الدفع لتحميل التطبيق، إلا أن وضع التركيز العميق لا يمنع التطبيقات الأخرى، مما يفقد التطبيق فائدته الأساسية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus tracking with an integrated reward system for planting trees.",
        "assistive_function_arabic": "يراقب التركيز مع نظام مكافآت مدمج لزراعة الأشجار.",
        "key_issues": "The user is very positive about the app, enjoying the way it rewards focus by planting trees.",
        "key_issues_arabic": "المستخدم إيجابي للغاية حول التطبيق، حيث يستمتع بطريقة مكافأته للتركيز من خلال زراعة الأشجار."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Pomodoro-style focus aid with features like tree planting and detailed statistics.",
        "assistive_function_arabic": "يساعد على التركيز بنمط بومودورو مع ميزات مثل زراعة الأشجار والإحصائيات التفصيلية.",
        "key_issues": "The review highlights severe issues such as instability, long loading times, frequent crashes, UI annoyances, and limited Apple Watch support, but also praises clever tree planting, competitions, and other valuable features.",
        "key_issues_arabic": "تشير المراجعة إلى مشاكل كبيرة مثل عدم الاستقرار، وطول وقت التحميل، والأعطال المتكررة، ومشاكل في واجهة المستخدم، ودعم محدود لساعة آبل، مع الإشادة بنظام زراعة الأشجار والمسابقات والميزات الأخرى القيمة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Focus tracker that supports solo tree planting and collaborative challenges.",
        "assistive_function_arabic": "يتتبع التركيز ويدعم زراعة الأشجار الفردية وتحديات التعاون.",
        "key_issues": "Overall, the user finds the app great for solo focus and tree planting but expresses frustration over the broken focus challenge and glitches in the group planting feature during beta.",
        "key_issues_arabic": "بشكل عام، يجد المستخدم التطبيق رائعًا لتتبع التركيز وزراعة الأشجار الفردية ولكنه أعرب عن استيائه من تعطل تحدي التركيز ومشاكل زراعة الأشجار الجماعية في النسخة التجريبية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid with engaging visuals.",
        "assistive_function_arabic": "يساعد في التركيز باستخدام رسومات جذابة.",
        "key_issues": "The app is praised for enhancing focus and offering cute tree visuals.",
        "key_issues_arabic": "يُشاد بالتطبيق لقدرته على تعزيز التركيز وتوفير رسوم أشجار لطيفة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid.",
        "assistive_function_arabic": "يساعد في التركيز.",
        "key_issues": "Mentions improved focus, although the review is incomplete.",
        "key_issues_arabic": "يشير إلى تحسن التركيز رغم أن النص غير مكتمل."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid at work.",
        "assistive_function_arabic": "يساعد على التركيز أثناء العمل.",
        "key_issues": "The app helps maintain focus at work while engaging users with tree imagery.",
        "key_issues_arabic": "يساعد التطبيق على الحفاظ على التركيز أثناء العمل ويوفر تجربة بصرية جذابة مع الأشجار."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid with productivity tracking.",
        "assistive_function_arabic": "يساعد على التركيز مع تتبع للإنتاجية.",
        "key_issues": "The review praises features like motivational gamification through tree planting, seasonal themes, customization, and detailed focus tracking. It also suggests improvements such as adding seasonal decorations, more tree species, and a Pomodoro timer.",
        "key_issues_arabic": "يمدح المراجع الميزات مثل التحفيز من خلال زراعة الأشجار، والسمات الموسمية، وإمكانية التخصيص، وتتبع التركيز بالتفصيل. كما يقترح تحسينات مثل إضافة زينة موسمية، المزيد من أصناف الأشجار، وتوقيت بومودورو."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid that minimizes distractions.",
        "assistive_function_arabic": "يساعد على التركيز عن طريق تقليل المشتتات.",
        "key_issues": "Highlights that the app eliminates phone distractions and motivates users by letting them plant real trees, positively impacting the real world.",
        "key_issues_arabic": "يوضح أن التطبيق يقضي على مشتتات الهاتف ويحفز المستخدمين من خلال زراعة الأشجار الحقيقية، مما يؤثر إيجابياً على العالم الواقعي."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Simple focus aid.",
        "assistive_function_arabic": "معين بسيط للتركيز.",
        "key_issues": "Mentions that the app helps with focus and expresses general satisfaction.",
        "key_issues_arabic": "يشير إلى أن التطبيق يساعد في التركيز ويعبر عن رضا عام."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Focus aid with distraction blocking.",
        "assistive_function_arabic": "معين للتركيز مع حجب المشتتات.",
        "key_issues": "Reports that the app stopped blocking other apps during focus time and caused loss of progress after reinstalling.",
        "key_issues_arabic": "يُبلغ عن توقف التطبيق عن حجب التطبيقات الأخرى أثناء التركيز وخسارة التقدم بعد إعادة التثبيت."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Focus aid using the Pomodoro technique.",
        "assistive_function_arabic": "يساعد على التركيز باستخدام تقنية بومودورو.",
        "key_issues": "Praised for its user-friendly interface and tree variety, but criticized for not allowing selection of different variations for tree species during longer focus sessions.",
        "key_issues_arabic": "أُشاد بواجهة المستخدم السهلة وتنوع الأشجار، لكنه انتقد عدم إمكانية اختيار تنوع الأشجار أثناء جلسات التركيز الطويلة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid for studying.",
        "assistive_function_arabic": "يساعد على التركيز أثناء الدراسة.",
        "key_issues": "States that the app is great for improving focus when studying.",
        "key_issues_arabic": "يذكر أن التطبيق رائع لتحسين التركيز أثناء الدراسة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid with gamification elements.",
        "assistive_function_arabic": "يساعد على التركيز باستخدام عناصر الألعاب.",
        "key_issues": "Loves the app for its gamification techniques that encourage continuous focus improvement.",
        "key_issues_arabic": "يعبر عن إعجابه بأساليب الألعاب التحفيزية التي تشجع على تحسين التركيز بشكل مستمر."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "sentiment_arabic": "مختلط",
        "review_score": null,
        "assistive_function": "Focus aid, though the deep focus mode is malfunctioning.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز، على الرغم من أن وضع التركيز العميق لا يعمل بشكل صحيح.",
        "key_issues": "Loves the app overall but notes that the deep focus mode is broken and needs a fix.",
        "key_issues_arabic": "يحب التطبيق بشكل عام لكنه يشير إلى أن وضع التركيز العميق معطل ويحتاج إلى إصلاح."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "review_score": null,
        "assistive_function": "Focus aid and productivity tool that is currently unreliable.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز والإنتاجية لكنها غير موثوقة حالياً.",
        "key_issues": "Complaints include infrequent updates, missing features like an auto-start break timer, and severe usability issues such as crashes, freezes, and unwanted behavior regarding tree tracking.",
        "key_issues_arabic": "يتضمن الشكوى من قلة التحديثات، وغياب ميزات مثل مؤقت الاستراحة التلقائي، ومشاكل كبيرة في سهولة الاستخدام مثل التعطل والتجمد وسلوك غير مرغوب فيه في تتبع الأشجار."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز.",
        "key_issues": "The reviewer praises the app for its effectiveness in helping them focus and its ease of use.",
        "key_issues_arabic": "يثني المراجع على فعالية التطبيق في المساعدة على التركيز وسهولة استخدامه."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid for studying and task completion.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز أثناء الدراسة وإنجاز المهام.",
        "key_issues": "The user mentions that the app has helped them focus despite limited usage, with no specific criticisms.",
        "key_issues_arabic": "يشير المستخدم إلى أن التطبيق ساعده على التركيز رغم استخدامه المحدود، دون أي انتقادات محددة."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Helps manage focus and attention, especially in relation to ADHD.",
        "assistive_function_arabic": "يساعد في إدارة التركيز والانتباه، خاصة بالنسبة لاضطراب نقص الانتباه مع فرط النشاط.",
        "key_issues": "The reviewer praises the app, noting it does wonders for managing ADHD symptoms.",
        "key_issues_arabic": "يمدح المستخدم التطبيق، مشيرًا إلى أنه يفعل عجائب في إدارة أعراض اضطراب نقص الانتباه مع فرط النشاط."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز.",
        "key_issues": "The reviewer finds the app to be a great tool for focus with no apparent problems.",
        "key_issues_arabic": "يجد المستخدم أن التطبيق أداة رائعة للتركيز دون مشاكل ظاهرة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid and productivity tracker that motivates reading and progress tracking.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز وتتبع الإنتاجية، تلهم المستخدم للقراءة وتتبع التقدم.",
        "key_issues": "Highlights that the app has encouraged reading and focus, and appreciates the feature of tracking effort through tree planting.",
        "key_issues_arabic": "يشير إلى أن التطبيق شجع على القراءة والتركيز، ويقدر خاصية تتبع الجهد عبر زراعة الأشجار."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Focus aid that enhances productivity by making focus sessions more enjoyable.",
        "assistive_function_arabic": "أداة للمساعدة في التركيز تزيد الإنتاجية بجعل جلسات التركيز أكثر متعة.",
        "key_issues": "The reviewer praises the app for making focusing fun and thereby improving productivity.",
        "key_issues_arabic": "يمدح المستخدم التطبيق لجعله التركيز أمرًا ممتعًا مما يزيد الإنتاجية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "sentiment_arabic": "سلبي",
        "review_score": null,
        "assistive_function": "Intended focus aid which becomes ineffective due to technical issues.",
        "assistive_function_arabic": "من المفترض أن يكون أداة للمساعدة في التركيز لكنه يصبح غير فعال بسبب المشكلات التقنية.",
        "key_issues": "The reviewer details multiple technical issues: after updating and reinstalling, the allow list feature for finance and banking apps causes the app to shut down, rendering it useless.",
        "key_issues_arabic": "يفصل المستخدم العديد من المشاكل التقنية: بعد التحديث وإعادة التثبيت، تؤدي خاصية قائمة السماح للتطبيقات المالية والمصرفية إلى إغلاق التطبيق، مما يجعله بلا فائدة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "sentiment_arabic": "إيجابي",
        "review_score": null,
        "assistive_function": "Study aid and focus booster that integrates gamification through tree planting.",
        "assistive_function_arabic": "أداة للدراسة وتعزيز التركيز تتضمن عناصر الألعاب من خلال زراعة الأشجار.",
        "key_issues": "The reviewer praises the app for helping maintain focus during study sessions and appreciates the gamified feature of earning and planting trees.",
        "key_issues_arabic": "يمدح المستخدم التطبيق لمساعدته على الحفاظ على التركيز أثناء الدراسة ويقدر ميزة الألعاب في كسب وزراعة الأشجار."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Tracks deep focus sessions by growing trees as a focus indicator.",
        "assistive_function_arabic": "يتعقب جلسات التركيز العميق عن طريق نمو الأشجار كمؤشر على التركيز.",
        "key_issues": "The app no longer tracks focus correctly when the user leaves the app, which undermines its purpose.",
        "key_issues_arabic": "لم يعد التطبيق يتتبع التركيز بشكل صحيح عند مغادرة المستخدم للتطبيق، مما يقوض هدفه."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Helps the user stay focused and provides motivation.",
        "assistive_function_arabic": "يساعد المستخدم على التركيز ويوفر له الدافع.",
        "key_issues": "The review praises the app for enhancing focus and motivation with no specific issues mentioned.",
        "key_issues_arabic": "يثني المراجع على التطبيق لتحسين التركيز والتحفيز دون ذكر مشاكل محددة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "neutral",
        "review_score": null,
        "sentiment_arabic": "محايد",
        "assistive_function": "Operates in deep focus mode to manage distractions.",
        "assistive_function_arabic": "يعمل في وضع التركيز العميق لإدارة المشتتات.",
        "key_issues": "The user notes that despite expecting negative consequences (plants dying) when navigating away, the expected effect does not occur.",
        "key_issues_arabic": "يشير المستخدم إلى أنه على الرغم من توقع عواقب سلبية (موت الأشجار) عند التنقل بعيدًا عن التطبيق، فإن النتيجة المتوقعة لا تحدث."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Aids in maintaining focus and boosts enthusiasm for work.",
        "assistive_function_arabic": "يساعد في الحفاظ على التركيز ويزيد من الحماس للعمل.",
        "key_issues": "The review praises the app for turning a dreaded work session into an exciting productivity session.",
        "key_issues_arabic": "يمدح المراجع التطبيق لقدرته على تحويل جلسة العمل المملة إلى جلسة إنتاجية مثيرة."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Serves as a focus aid with gamified elements like cool trees and special events that reward time invested.",
        "assistive_function_arabic": "يعمل كمساعد على التركيز مع عناصر ترفيهية مثل الأشجار الرائعة والأحداث الخاصة التي تكافئ الوقت المستثمر.",
        "key_issues": "User is highly satisfied with the app's performance and gamification features, finding it superior to other alternatives.",
        "key_issues_arabic": "المستخدم راضٍ للغاية عن أداء التطبيق وميزاته الترفيهية، ويراه أفضل من البدائل الأخرى."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Aims to help users focus by providing timed sessions.",
        "assistive_function_arabic": "يهدف إلى مساعدة المستخدمين على التركيز من خلال تقديم جلسات زمنية.",
        "key_issues": "The app fails to stay logged in, which disrupts productivity by forcing repeated logins during focus sessions.",
        "key_issues_arabic": "يفشل التطبيق في البقاء مسجلاً للدخول، مما يعطل الإنتاجية بسبب الحاجة إلى إعادة تسجيل الدخول المتكرر خلال جلسات التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Helps keep the user off the phone to enhance focus.",
        "assistive_function_arabic": "يساعد في إبقاء المستخدم بعيداً عن الهاتف لتعزيز التركيز.",
        "key_issues": "While the app is praised for keeping the user off the phone, the inclusion of microtransactions in a paid app is criticized for detracting from its main focus feature.",
        "key_issues_arabic": "في حين يُمدح التطبيق لإبعاده المستخدم عن الهاتف، يتم انتقاد وجود معاملات مالية صغيرة في تطبيق مدفوع لأنها تقلل من فعالية ميزة التركيز الأساسية."
    },
    {
        "condition_mentioned": "ADHD",
        "condition_mentioned_arabic": "اضطراب نقص الانتباه مع فرط النشاط",
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Uses a visible timer as a focus aid that provides a sense of accomplishment.",
        "assistive_function_arabic": "يستخدم مؤقتاً مرئياً كمساعد للتركيز ويوفر شعوراً بالإنجاز.",
        "key_issues": "The user highlights that the timer feature is particularly helpful in managing ADHD by offering measurable progress.",
        "key_issues_arabic": "يسلط المستخدم الضوء على أن ميزة المؤقت مفيدة بشكل خاص في إدارة اضطراب نقص الانتباه مع فرط النشاط من خلال تقديم تقدم يمكن قياسه."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Serves as a focus aid despite typographical errors in the review.",
        "assistive_function_arabic": "يعمل كمساعد للتركيز على الرغم من وجود أخطاء مطبعية في المراجعة.",
        "key_issues": "The review implies that the app helps with focus, though the text is unclear due to typos.",
        "key_issues_arabic": "تشير المراجعة إلى أن التطبيق يساعد في التركيز، على الرغم من عدم وضوح النص بسبب الأخطاء المطبعية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "negative",
        "review_score": null,
        "sentiment_arabic": "سلبي",
        "assistive_function": "Designed to help users focus by minimizing distractions.",
        "assistive_function_arabic": "مصمم لمساعدة المستخدمين على التركيز عن طريق تقليل المشتتات.",
        "key_issues": "The review criticizes the app for not penalizing device usage, making it less effective for users without strong willpower.",
        "key_issues_arabic": "تنتقد المراجعة التطبيق لعدم معاقبة استخدام الجهاز، مما يجعله أقل فعالية للمستخدمين الذين يفتقرون إلى الإرادة القوية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid",
        "assistive_function_arabic": "أداة للمساعدة على التركيز",
        "key_issues": "User loves the app, enjoys the ability to customize time settings and focus on tasks.",
        "key_issues_arabic": "يحب المستخدم التطبيق ويتمتع بإمكانية تخصيص إعدادات الوقت والتركيز على المهام."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid with gamification (tree planting)",
        "assistive_function_arabic": "أداة للمساعدة على التركيز مع التحفيز عن طريق زرع الأشجار",
        "key_issues": "User is excited about planting trees while studying, appreciating the locked phone feature that enhances focus.",
        "key_issues_arabic": "المستخدم متحمس لزرع الأشجار أثناء الدراسة ويقدر ميزة قفل الهاتف التي تعزز التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid and social connectivity for group study",
        "assistive_function_arabic": "أداة للمساعدة على التركيز وتوفير التواصل الاجتماعي للدراسة الجماعية",
        "key_issues": "User appreciates the app for helping them stay focused and connect with friends for group study.",
        "key_issues_arabic": "يُقدّر المستخدم التطبيق لأنه يساعده في البقاء مركزًا والتواصل مع الأصدقاء للدراسة الجماعية."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "mixed",
        "review_score": null,
        "sentiment_arabic": "مختلط",
        "assistive_function": "Focus aid with gamification elements (tree growth tracking)",
        "assistive_function_arabic": "أداة للمساعدة على التركيز مع عناصر الألعاب مثل تتبع نمو الشجرة",
        "key_issues": "User loves the app but is frustrated that the deep focus mode does not block non-allowed apps, which resets tree growth progress. There is also a suspicion that this might be intentional.",
        "key_issues_arabic": "يحب المستخدم التطبيق ولكنه يشعر بالإحباط من أن وضع التركيز العميق لا يمنع استخدام التطبيقات غير المسموح بها، مما يؤدي إلى مسح تقدم نمو الشجرة. وهناك شكوك بأنه قد يكون الأمر مقصودًا."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid",
        "assistive_function_arabic": "أداة للمساعدة على التركيز",
        "key_issues": "User mentions having difficulty focusing, but praises the app for significantly helping improve focus.",
        "key_issues_arabic": "يشير المستخدم إلى صعوبة في التركيز، ولكنه يُشيد بالتطبيق لمساعدته الكبيرة في تحسين التركيز."
    },
    {
        "condition_mentioned": null,
        "condition_mentioned_arabic": null,
        "sentiment": "positive",
        "review_score": null,
        "sentiment_arabic": "إيجابي",
        "assistive_function": "Focus aid specifically for studying",
        "assistive_function_arabic": "أداة للمساعدة على التركيز خاصة أثناء الدراسة",
        "key_issues": "User, a student, values the app for helping him stay focused and on task while studying.",
        "key_issues_arabic": "يُقدّر المستخدم، وهو طالب، التطبيق لمساعدته على البقاء مركزًا وعلى المسار الصحيح أثناء الدراسة."
    }
]