[
    {
        "id": 12754667862,
        "date": "2025-06-09T08:41:58-07:00",
        "user_name": "NikkiBeany",
        "rating": 1,
        "title": "Lost all app data after clicking free coins and monstera promo, customer service unresponsive",
        "content": "I have been using the app since 2019 and I have enjoyed doing the monthly challenges this year. Recently, however, when I clicked on the free coins and monstera promo on June 5th, my app reset, wiping out all the rewards I’d earned since 2019. I have reached out to customer service for assistance but have not heard back. I don’t anticipate they will respond or help me fix it so I am now looking for a different app to use to help me focus. Thanks for nothing, Pomodoro Timer."
    },
    {
        "id": 12752321031,
        "date": "2025-06-08T17:25:22-07:00",
        "user_name": "budicrum",
        "rating": 5,
        "title": "Nice app",
        "content": "My friendly AI app recommended this Forest to me. 🌟Apparently, I downloaded it and never opened it prior to the recommendation. Still, in the context of why it was recommended to focus on intentionally settling down throughout the day, it has been a compliment to my life."
    },
    {
        "id": 12735641848,
        "date": "2025-06-04T10:00:03-07:00",
        "user_name": "Yliana A.",
        "rating": 5,
        "title": "Adult Female with ADD",
        "content": "I love this app, it’s so helpful by blocking out applications that are not in the preselected list(that you can customize). Which helps prevent doom scrolling and distractions that are on your device, if you choose to use an app that is not on the list will result in the death of your tree. I know it’s not a real tree but it does help with the negative reinforcement feeling that I need to stay focused. I’m in college also so need help blocking off my study times. I do also still use an pomodoro timer bc I need an added visual aid, but using both together has been a game changer in my everyday life. Would totally recommend this app to a friend."
    },
    {
        "id": 12715455892,
        "date": "2025-05-30T06:19:05-07:00",
        "user_name": "datgulay",
        "rating": 5,
        "title": "Great",
        "content": "You can set it by minutes to 2 hours so it really helps with focusing for that moment, and seeing the trees grow, it’s like a reward for your discipline."
    },
    {
        "id": 12714075528,
        "date": "2025-05-29T21:04:22-07:00",
        "user_name": "CubanBoy93",
        "rating": 5,
        "title": "Thanks!!!",
        "content": "I’ve tried several apps to help me stay focused while studying, but Forest is the only one that truly transformed how I learn. As someone who used to struggle with attention and often felt frustrated for not “giving my all,” Forest helped me turn my perfectionism into a healthy motivation.\n\nThe ability to “plant trees” that grow based on how long I stay focused pushes me to beat my own record every day, and that has boosted my productivity like nothing else. Now I can maintain long study sessions (7 to 8 hours or more in a day) with steady focus that used to feel impossible.\n\nPlus, seeing my progress visually reflected in a growing forest gives me a real, tangible sense of achievement. Forest has helped me not only study faster but also process and digest information better, moving past the anxiety of immediate perfection to focus on steady progress.\n\nFor anyone struggling with concentration or motivation, Forest isn’t just an app—it’s a companion that helps you reprogram your mind and build habits that actually work.\n\nSuggestions: I would love to see a widget for iPhone standby mode to make tracking even easier. Also, giving users more opportunities to earn or buy trees would be awesome—because who wouldn’t want a bigger, greener forest?"
    },
    {
        "id": 12712437441,
        "date": "2025-05-29T10:26:04-07:00",
        "user_name": "kvnjmle",
        "rating": 3,
        "title": "Dislike the “Pay-to-Play”",
        "content": "The concept behind these focus apps is to hijack our brain’s reward systems to be productive rather than distracting. You get dopamine from focusing and getting a tree planted. But when the “reward” (planting a tree, unlocking trees, etc) becomes the goal in itself, then the app becomes a distraction in itself.  The first time I stopped using this app, I stopped because I had become obsessed with growing a beautiful forest. I notice there’s a lot of “pay-to-play” that takes advantage of this misdirected reward system, where you can pay to get more coins or diamonds to get more rewards. It would be good if these options were not so visible on the app and could be turned off and only accessible in the settings. This takes advantage of our brain’s reward systems for the developers’ profit rather than helping us direct it towards becoming productive."
    },
    {
        "id": 12709956963,
        "date": "2025-05-28T19:16:57-07:00",
        "user_name": "Okay fine sad face",
        "rating": 1,
        "title": "Honestly kind of boring",
        "content": "It's hard to stay focused with something like this even: if anything it just makes me more stressed about goals, since its about numbers rather than successes."
    },
    {
        "id": 12708592709,
        "date": "2025-05-28T10:35:24-07:00",
        "user_name": "Varonika singh",
        "rating": 5,
        "title": "ASAP",
        "content": "This is the only thing that is keeping my Adhd in check . But what happens after I buy all of the trees from store …!? I don’t want to lose motivation…. Can you add more trees .. or add more feature likes your tree grows this much in a month of grass grows this much …or features like being able to buy a lawn mover or pesticide for trees or ornaments for trees…. Something to keep the forest customized according to the user… anyone with adhd or autism will love these …. I have a very detailed UI and plan for 20 + features that are simple enough to use and will keep up the momentum if you are interested:)"
    },
    {
        "id": 12704720869,
        "date": "2025-05-27T09:55:36-07:00",
        "user_name": "TacticalGoldfinch",
        "rating": 1,
        "title": "Event takes my coins or doesn’t work at all.",
        "content": "This event was supposed to be fun! I really wanted the 11th anniversary cake. And now I think honestly the glitches scammed me out of it. I can’t spend coins because if I do the event takes them and doesn’t give a reward. Now when I go to the event it forever loads and does not tell me how many wishes I have left, or how many more. I have to be guaranteed the cake tree. This is so upsetting, I miss when the goal was to focus long enough to unlock the cake."
    },
    {
        "id": 12701655150,
        "date": "2025-05-26T13:46:40-07:00",
        "user_name": "Lllffzz",
        "rating": 2,
        "title": "I regret buying this app",
        "content": "This is not an app that is trying to support users to focus. It’s a store that’s optimized to make money and that’s all. It has a million ways to add to distraction instead of lessen them. It’s constantly trying to see you things. It tries to encourage longer focus times without breaks, even though studies show that’s both cognitively and physically (if you’re sitting) unhelpful - meaning the makers of this app fundamentally don’t understand the pomodoro method.\n\nEven worst, it doesn’t actually block other apps like it says it does.  In order try to make that work you have to do an enormous additional amount of work in settings to change how screen time works. It’s also super buggy and crashes"
    },
    {
        "id": 12693222494,
        "date": "2025-05-24T09:36:35-07:00",
        "user_name": "GoodName3717",
        "rating": 4,
        "title": "Work for me",
        "content": "Forest is an amazing productivity app. Simple, effective, and it genuinely helped me stay focused and build better habits."
    },
    {
        "id": 12674717349,
        "date": "2025-05-19T12:51:36-07:00",
        "user_name": "Car Analogy",
        "rating": 5,
        "title": "It does do breaks",
        "content": "It’s not intuitive, but after a focus session you can manually start a break timer. So it does do Pomodoro but it’s not as obvious about it as it should be."
    },
    {
        "id": 12666473113,
        "date": "2025-05-17T07:56:45-07:00",
        "user_name": "the bird guy.",
        "rating": 4,
        "title": "helpful app, but a bad bug.",
        "content": "typically i’m skeptical with paying for apps since i don’t know if i will like what i payed for, but i’ve been using it for half a year since i have terrible adhd, so i think i’m good in that regard. however, with the most recent update ( i’ve seen others mention the same issue ), all of my planted trees—except yesterdays—have disappeared completely? \n\ni use this app to document hours for driving, and some other activities too. typically, i document my driving hours at the end of every week ( though i’m behind on my documentation because i have been really busy ). today, i just so happened to check how many hours i had done this week and a couple previous times so i could write it down, when poof! …suddenly, i have no trees in my forest from this week, last month, and even from when i started last year. this is quite stressful and upsetting for me, as i am working towards getting my license. now i’m missing hours in my record that i should have had so that i can progress. i would really appreciate if this gets fixed asap."
    },
    {
        "id": 12655944527,
        "date": "2025-05-14T10:50:59-07:00",
        "user_name": "NJ Fins Fan",
        "rating": 5,
        "title": "Life changing",
        "content": "This app has seriously improved my life.  It has trained me to not look to my phone as a distraction and instead forces me to think about It first and then refocus my energy and most times that means making a more positive choice than doomscrolling"
    },
    {
        "id": 12655823713,
        "date": "2025-05-14T10:09:02-07:00",
        "user_name": "❥𓆉❣︎シ ☏",
        "rating": 5,
        "title": "Amazing help with online classes",
        "content": "This app is absolutely amazing. As a person who easily gets distracted by their phone in online classes I can easily set a timer with a tag for school on deep focus mode and it helps me not get distracted. It also is very satisfying when you have a forest filled with almost no dead trees. Definitely would recommend to a friend"
    },
    {
        "id": 12642119409,
        "date": "2025-05-10T15:01:19-07:00",
        "user_name": "Jeni Shi",
        "rating": 5,
        "title": "great",
        "content": "I love this app! There is a lot of cute trees and I can focus more with this! 💗💗💗💗"
    },
    {
        "id": 12598732044,
        "date": "2025-04-29T03:11:43-07:00",
        "user_name": "adhd in denver",
        "rating": 5,
        "title": "Helps my ADHD",
        "content": "A great tool for helping people with ADHD. Reminds me to focus on one task, helps me to remember to take breaks, is kinda cute too. One of my favorite apps."
    },
    {
        "id": 12586619347,
        "date": "2025-04-25T20:04:14-07:00",
        "user_name": "Kevgall120",
        "rating": 5,
        "title": "Silence the noise",
        "content": "This app helps me refrain from mindlessly reopening and/or refreshing apps. Refocuses your energy off the doom scroll machine."
    },
    {
        "id": 12584747664,
        "date": "2025-04-25T08:29:09-07:00",
        "user_name": "thelilnix",
        "rating": 5,
        "title": "Awesome",
        "content": "That’s really awesome and useful,\nI used some time management apps before, but this app helped me stay more focused and I won’t even realize how I have done my work!"
    },
    {
        "id": 12572027704,
        "date": "2025-04-22T00:13:35-07:00",
        "user_name": "Beeluvsbees!",
        "rating": 5,
        "title": "Phenomenal App",
        "content": "This app is genuinely wonderful in every sense of the word. No ads, ability to change which apps are allowed in deep focus, different tags for focusing, many different trees to choose from, and even the option to plant real trees using your earned coins! I also love the statistics you can see after studying for a while. I have logged 45 hours so far and I can’t wait to keep going! Phenomenal app overall."
    },
    {
        "id": 12571645158,
        "date": "2025-04-21T21:04:17-07:00",
        "user_name": "Mr_nugget_09",
        "rating": 5,
        "title": "Helped a lot",
        "content": "This app has been so helpful and fun especially because I have adhd it has really let me focus"
    },
    {
        "id": 12570194476,
        "date": "2025-04-21T11:18:04-07:00",
        "user_name": "^Lana98;)^",
        "rating": 5,
        "title": "Came back to the app after a hiatus",
        "content": "I used this app when I studied for the MCAT. I came back after a few years to help with mindfulness and found this app really helps keep me focused. Thanks Forest 🥰"
    },
    {
        "id": 12555067131,
        "date": "2025-04-17T12:52:18-07:00",
        "user_name": "XXxXx.0000.00.xx00",
        "rating": 5,
        "title": "Deleted YEARS of Data",
        "content": "After years of happily using this product to help me focus, I opened the app to find that ALL of my user data, purchased add-ons, and records are gone. I didn’t change phones, delete/reinstall the app, or do anything to prompt this deletion. I didn’t even know I had been operating in guest mode until I had the login prompt: continuing as a guest didn’t make a difference, all of my usage data and purchases were already gone. And no, I didn’t switch between the “China server” and the “global server.”\n\nI will now be looking for a new focus app; I am so disappointed after paying for this app and being a product evangelist for almost a decade. Don’t trust them with your data if they’ll lose it for no reason."
    },
    {
        "id": 12547578069,
        "date": "2025-04-15T14:21:58-07:00",
        "user_name": "JavaFenn",
        "rating": 1,
        "title": "Too many bugs, not enough updates",
        "content": "I love this app but there are too many bugs. The widgets never work and no matter how I set the focus it doesn’t make apps I have in the focus unavailable. I want to love this but it’s just not worth it. I’ll be finding a different focus app."
    },
    {
        "id": 12539537549,
        "date": "2025-04-13T11:44:31-07:00",
        "user_name": "lpaige90",
        "rating": 4,
        "title": "Constant bugs lately",
        "content": "I have been using this app for many years now and I have recommended it to so many people. But for the past several months, there are constant bugs that cause me to spend more time messing with the app and I can’t just “set it and forget it” like I used to. The bugs are mostly relegated to the newer Focus Challenges, which I thought would be really helpful for me earlier in the day when I want to get smaller tasks done. Now I can’t click on the screen to accept the reward from completing a challenge right away, I have to let it sit here for nearly a minute before I can finally click on it. When the feature first came out I would get an error any time I tried to complete a challenge. Then when that was finally fixed, it wasn’t giving me credit for a while until 12+ hours later. I paid for the full version of this app long ago and I am really disappointed lately. I need something to help me with productivity, not frustrate me and cause more of a distraction. If a feature doesn’t work properly, don’t release it until it is ready. “Beta” or not. That isn’t right, especially for your paying customers."
    },
    {
        "id": 12527068204,
        "date": "2025-04-10T10:05:27-07:00",
        "user_name": "Arowles",
        "rating": 5,
        "title": "Cute!",
        "content": "So cute and fun makes me want to focus"
    },
    {
        "id": 12496408651,
        "date": "2025-04-02T16:15:18-07:00",
        "user_name": "Michael333999",
        "rating": 5,
        "title": "Focus",
        "content": "Worth every penny fr! Very Good app for monk mode, or just focus in general. Also as you build up your forest you can start to plant real trees so then your focus becomes an act of giving back to nature in every moment. I hope you guys spend the couple dollars and become a human again and enjoy your time with friends and family in the process 💯🌲"
    },
    {
        "id": 12489270861,
        "date": "2025-03-31T21:48:13-07:00",
        "user_name": "(………)…..",
        "rating": 5,
        "title": "Highly recommend",
        "content": "Great app for focusing, app works well almost all the time. Developer is responsive to issues with the app, on the rare occasions they occur."
    },
    {
        "id": 12480289364,
        "date": "2025-03-29T15:32:31-07:00",
        "user_name": "Anna1621",
        "rating": 5,
        "title": "Always a motivator",
        "content": "I’m so much more productive with this app. It helps me focus and the flexibility to choose. The amount of time is so helpful."
    },
    {
        "id": 12464929892,
        "date": "2025-03-25T18:44:50-07:00",
        "user_name": "geosarai",
        "rating": 5,
        "title": "Perfect",
        "content": "It really helps me to focus on my studies!"
    },
    {
        "id": 12463513952,
        "date": "2025-03-25T10:20:44-07:00",
        "user_name": "Quintro",
        "rating": 5,
        "title": "I really appreciate this app 😁",
        "content": "This is such a useful tool to stay focused and track my focus work!  So many extra features that aren’t needed but are really helpful!"
    },
    {
        "id": 12444057647,
        "date": "2025-03-20T14:15:37-07:00",
        "user_name": "Opie96",
        "rating": 4,
        "title": "Great app!",
        "content": "Forest has been great so far! I’ve literally completed hours worth of cleaning this week. I love the little trees and being able to plant with my friend. I also love the count up timer as I hate normal timer focus options that force me to break focus but this is great!\n\nI have some issues with the allow list (customizable lists of apps you’re allowed to use while focusing). The main thing is my app freezes whenever I try to add anything from the education section or search for particular apps. That’s my only sincere problem with the app though. \n\nThe following are just some possible suggestions I’ve thought of:\nI would appreciate the ability to change allow lists and/or task tags partway through a session. \nA pause/break option (with allow list still functioning) because sometimes things do come up or maybe you get tired\nHonestly that’s it. I really like this app so far though"
    },
    {
        "id": 12443237522,
        "date": "2025-03-20T09:40:12-07:00",
        "user_name": "dheurbhehe",
        "rating": 2,
        "title": "Keeps messing up tags",
        "content": "I have multiple tags for the things I focus on, which is helpful for the charts and graphs it provides, but it keeps deleting or changing the names of them. Nearly every time I go to start a timer with a tag, half of my tags are renamed to have a 1 or 2 at the end of it. I’d have a “Study” timer but when I look at it I’ll have a “Study 1” “Study 1 1” and a “Study 1 1 1” timer, or even worse the study timer would just be deleted. \n\nPlease fix this bug as it makes it feel pointless to track what I’m doing if you’re going to keep deleting, adding, or renaming my tags"
    },
    {
        "id": 12439139701,
        "date": "2025-03-19T08:08:48-07:00",
        "user_name": "arushi10883jdhe",
        "rating": 5,
        "title": "Best one time purchase of my life",
        "content": "Been using since 2018. Life changing for those with adhd. It helped me get into NYU and graduate with honors in high school. Can't recommend it highly enough. I'm devastated that they switched to a subscription model. I Guess the investors got really greedy."
    },
    {
        "id": 12439018365,
        "date": "2025-03-19T07:32:07-07:00",
        "user_name": "4fungames",
        "rating": 5,
        "title": "So far so good",
        "content": "I’m enjoying being able to “grow” pretty plants. This is helping me somewhat with my ADHD to keep on track for longer than I have been able to focus in the past. I’m still learning the app and settings but so far I’m happy."
    },
    {
        "id": 12427731402,
        "date": "2025-03-16T07:53:49-07:00",
        "user_name": "ArnXav",
        "rating": 2,
        "title": "So many bugs",
        "content": "Almost every time I go to the “Focus Challenges” there are so many bugs. Sometimes I finish the challenges and it won’t let me get the award. Now challenges are not even visible and says “1,975” yrs, 9 mths”. I have been using this app for so many years and it seems that these bugs are getting out of control now. So sad. It was a good app, I’m considering to delete it."
    },
    {
        "id": 12425231619,
        "date": "2025-03-15T16:21:53-07:00",
        "user_name": "Tydaddy55",
        "rating": 3,
        "title": "Buggy but nice concept",
        "content": "The function of growing trees while studying/focusing works and is nice, but there are frequent bugs afflicting the focus challenges."
    },
    {
        "id": 12416818570,
        "date": "2025-03-13T13:43:34-07:00",
        "user_name": "alexisahseis",
        "rating": 1,
        "title": "Fix bugs!",
        "content": "Focus challenge page crashed and did not log my accomplishments of challenge!!"
    },
    {
        "id": 12416027194,
        "date": "2025-03-13T09:12:38-07:00",
        "user_name": "counter998452",
        "rating": 2,
        "title": "Guaranteed frustration",
        "content": "The focus challenge was designed by a psychologist to cause distress. You see tasks that you can complete for a reward. You complete the task. Reward status does not update. It's like when you work out for three hours and your apple watch fails to update your rings. I spent way too much time trying to refresh the app to get credit for these challenge tasks. It's embarrassing. I just have to delete forest and get on with my life. Seemed fun but it is actual psychological torture."
    },
    {
        "id": 12413458866,
        "date": "2025-03-12T16:05:33-07:00",
        "user_name": "Adriana mysore",
        "rating": 5,
        "title": "Finally an app that can keep my reading streaks or anything I do!",
        "content": "I found the app on chatgpt. I was looking for ways to increase my reading and make it more entertaining and maybe impossible to forget. An app that gives you that craving to go and read! This app helped me and the ideas of planting trees while you’re doing something and focusing is just so cute! Thank you guys!"
    },
    {
        "id": 12411830394,
        "date": "2025-03-12T06:48:50-07:00",
        "user_name": "CBA93",
        "rating": 5,
        "title": "Great for work focus w/ADHD",
        "content": "I started using Forest as a last resort during a difficult period in my life, where balancing life and focus was becoming overwhelmingly impossible. It’s option to lock all other apps while on the focus timer has been a game changer! It helps me focus for multiple hours on my work without going back to my phone, and the locked apps keep me from derailing my focus process!"
    },
    {
        "id": 12397309326,
        "date": "2025-03-08T09:44:14-07:00",
        "user_name": "3dbitmojih8r",
        "rating": 5,
        "title": "I love it",
        "content": "I’m in STEM and have ADHD so this helps"
    },
    {
        "id": 12381903835,
        "date": "2025-03-04T10:41:23-07:00",
        "user_name": "pushicko",
        "rating": 4,
        "title": "Great productivity app sometimes glitchy",
        "content": "Love the trees and events, focus challenge is a great addition, BUT it glitches and sometimes doesn’t complete the challenge when I planted what I needed to: doesn’t let me collect gifts. \nAlso, the allow list is glitchy I can only add apps one at a time or it crashes within 5-10 seconds and kicks me out of “edit allow list tab”"
    },
    {
        "id": 12378895624,
        "date": "2025-03-03T15:20:57-07:00",
        "user_name": "EmiliexJ",
        "rating": 5,
        "title": "Awesome",
        "content": "This app helps me focus so well"
    },
    {
        "id": 12375258433,
        "date": "2025-03-02T16:15:18-07:00",
        "user_name": "C h a n e l l e",
        "rating": 5,
        "title": "Life Saver",
        "content": "Coming from someone who struggles with a low attention span, gonna keep this review short as possible. This is a life changer, no other words, it helps me focus on getting stuff done. If ur thinking about whether or not to get it, do it🙏🏽"
    },
    {
        "id": 12369621787,
        "date": "2025-03-01T07:59:18-07:00",
        "user_name": "Ggwpis",
        "rating": 3,
        "title": "Major technical issues",
        "content": "I REALLY love this app, but when it comes to functionality, I find myself not able to rely on the whitelist and Deep Focus function that is supposed to lock and unlock certain apps. I’ve had a bug for months where every time I try to edit my whitelists or create new ones, the screen goes blank and I have to close and reopen the app. So, I can only enable my Deep Focus when I want my iPhone completely bricked, which is very rare because I don’t like that it bricks my iMessage in the default settings. Really wish they could fix this. I’ve reached out to customer service about the inability to use safari, when when it’s included in a whitelist, and they informed me there’s nothing to do about that. \nBut aside from technicality, I love this app, which is why I wish it ran smoother"
    },
    {
        "id": 12353574666,
        "date": "2025-02-25T06:50:54-07:00",
        "user_name": "14792678",
        "rating": 4,
        "title": "So much potential",
        "content": "I usually never write app reviews but I really wanted to give my feedback on this one! I love this app but it would be so much more fun and fulfilling to use if it had a feature that allowed you to visualize the focus time you give to certain categories. For me, I use a specific type of tree for each project im working on,etc. so that when I look at my garden I can kind of visualize where my energy is going. It would be amazing if the app incorporated one of those matching puzzle type of game elements to grow a larger tree by combining trees of a certain type. I think it would be really fun to be able to earn 3 small trees then combine those into a bigger tree, then earn 3 of those and make an even bigger tree, you get the idea. It would be more visually appealing to see the trees with more drastic size differences too. Also i think there’s a nice metaphorical reminder in there that the plant you water most will grow the tallest. Please consider adding these features !"
    },
    {
        "id": 12353467129,
        "date": "2025-02-25T06:19:06-07:00",
        "user_name": "ih8ticketmaster420",
        "rating": 5,
        "title": "best app",
        "content": "I never leave app reviews but I have been using Forest regularly (daily) for the past 3 years and it is wonderful. I love how new tree species are added, the focus challenge is my absolute favorite and really motivates me to turn my phone off more. I would recommend this app to anyone with ADHD that is trying to get through their education, Forest helps me so much. To the developers: continue the Focus challenge, game-ifying being off your phone helps ADHD folks so much."
    },
    {
        "id": 12338685931,
        "date": "2025-02-21T12:09:41-07:00",
        "user_name": "curlyheadmonie",
        "rating": 5,
        "title": "Awesome Study tool!",
        "content": "I needed an app to help me stay focus and productive when trying to complete a task. This app is amazing for achieving those goals. Personally I wish the times were longer but longer isn’t always good/necessary."
    },
    {
        "id": 12338354158,
        "date": "2025-02-21T10:15:04-07:00",
        "user_name": "HamzaAbdullahKhan",
        "rating": 5,
        "title": "The only one-time purchase you’ll never regret",
        "content": "I love this app. Been using it for two years now and I can honestly say, it is one of the best apps for productivity. The thought of you cancelling your focus session and seeing dead trees in your forest, makes you control your urges and focus back onto your task. I’m not sure about the new subscription model but for now the lifetime purchase has been a game changer for me. Would 100% recommend it to everyone."
    },
    {
        "id": 12331843304,
        "date": "2025-02-19T18:38:06-07:00",
        "user_name": "ShawtyB23",
        "rating": 5,
        "title": "Life Changing",
        "content": "Listen. I have a lot going on. I am about to turn 30, mid-divorce, and beginning a new chapter of life as a single mom. I cannot oversell it: this app is getting me through it. Stuck in ADHD freeze mode and depressed? Not anymore. My lil focus forest is growing and I am accomplishing more than I thought I could. I love it."
    },
    {
        "id": 12327501322,
        "date": "2025-02-18T15:54:17-07:00",
        "user_name": "PattyFruFru",
        "rating": 1,
        "title": "Completely deleted all my previous data.",
        "content": "I’ve had this app for years and I used it religiously! It has helped me deal with my ADHD so much and it made me so proud when I could get a new plant and see all my progress.\nThat is until one day I opened the app and I was logged out of my account. That had never happened, I was confused but though it probably just updated or something. But when I logged back in, it was like I had just purchased the app. There was no record of previous years and I only had the plants you start with. I went to the settings and followed the instructions to try to recover data, which didn’t work. So I emailed the support email and haven’t received anything back from them. \nI am very disappointed by this because this app has actually improved my productivity tremendously and I really hope this can be fixed."
    },
    {
        "id": 12324851864,
        "date": "2025-02-18T00:28:16-07:00",
        "user_name": "Samo2025",
        "rating": 5,
        "title": "It is a great app but it needs more challenges",
        "content": "We need at least two focus  monthly  challenges to keep the users engage and motivate them to use the app daily to be more productive in their daily lives."
    },
    {
        "id": 12324361420,
        "date": "2025-02-17T20:35:55-07:00",
        "user_name": "Hawaii Gurl",
        "rating": 5,
        "title": "Pursuing a graduate degree with this app…",
        "content": "I never leave comments but I’m so extremely grateful for this app, I just have to share. I have ADHD-like tendencies (not diagnosed), and pursuing a graduate degree seemed like a big jump. Thanks to this app, the amount of time that I can focus increased from 15 minutes at a time to one hour! I added a widget to my Home Screen that shows my forest everyday, as well as how many minutes I’ve studied. It’s a huge motivation to sit down and focus for even just a short time everyday to see some trees on the Home Screen page. I feel proud at the end of the day/week/month looking back at my lush forest. Also, thank you also for adding the challenges! I usually finish them pretty quickly but they help me to start my month off right, and I can ride the momentum even after I’ve completed the challenge. I use the app in conjunction with the finch app, and also study with me videos on YouTube. :)"
    },
    {
        "id": 12323084665,
        "date": "2025-02-17T12:10:25-07:00",
        "user_name": "Mike’s Food Reviews",
        "rating": 5,
        "title": "Anti-Doomscroll Medication",
        "content": "Forest helps me avoid doomscrolling and stay focused on important tasks. What makes this app particularly effective is that my subconscious doesn’t want to kill the tree. Unlike other apps, where I can exit without consequence, Forest makes me less tempted to get distracted. Instead of subconsciously looking for an escape, my mind stays focused on my work."
    },
    {
        "id": 12318117862,
        "date": "2025-02-16T07:01:51-07:00",
        "user_name": "maryasau",
        "rating": 1,
        "title": "Can’t edit allowed app list",
        "content": "I want to add somes apps to a new allowed app list for deep focus mode, but the app freezes everytime the app list shows up"
    },
    {
        "id": 12308540815,
        "date": "2025-02-13T21:10:55-07:00",
        "user_name": "Ocean Angel 333",
        "rating": 5,
        "title": "Organized",
        "content": "So far I’m loving it. I feel rewarded for keeping track of time. This is perfect for time blocking and setting a frame to focus."
    },
    {
        "id": 12295821282,
        "date": "2025-02-10T14:32:37-07:00",
        "user_name": "betelgeuse29",
        "rating": 5,
        "title": "Helpful for mindfulness",
        "content": "This app is so much fun and helps me stay focused on what needs to be done, with gentle reminders and a cute forest to look forward to planting 😊"
    },
    {
        "id": 12294880254,
        "date": "2025-02-10T09:10:35-07:00",
        "user_name": "Orphan-source",
        "rating": 5,
        "title": "Helpful with ADHD and doomscrolling.",
        "content": "I have really severe ADHD and have a heavy workload. I’ve gotten more done in the last few days with Forest than I probably did all of last week. It can be hard to find stuff that helps but this app really, REALLY helps for me!!"
    },
    {
        "id": 12282478848,
        "date": "2025-02-07T08:52:19-07:00",
        "user_name": "dianahopper",
        "rating": 5,
        "title": "Helpful in so many ways other than productivity",
        "content": "I have ADHD, and while medication helps me focus, I still struggle with too little focus or too much focus. (iykyk)\n\nGamifying my focus cycle has helped balance the scales and break some bad habits, including mindlessly scrolling on my phone for a dopamine hit when I should be doing a work task)\nSo, yes, it helps me stay focused, it also helps me to remember to take breaks periodically and to not dilly-dally to much during them."
    },
    {
        "id": 12279551413,
        "date": "2025-02-06T15:07:53-07:00",
        "user_name": "ReddLionz",
        "rating": 5,
        "title": "Fantastic Focus App",
        "content": "This is so much better than Opal, which is always trying to sell you a subscription. This has a clean, calming interface, can block your apps, and the tree planting is  an awesome way to track your focusing progress. Really recommend this one."
    },
    {
        "id": 12275448177,
        "date": "2025-02-05T14:47:22-07:00",
        "user_name": "ccurlygirl",
        "rating": 5,
        "title": "I love it!",
        "content": "Fun way to keep tract on focusing on Studying my Bible and study for my meetings."
    },
    {
        "id": 12275157215,
        "date": "2025-02-05T12:58:46-07:00",
        "user_name": "Karch Swaylik",
        "rating": 5,
        "title": "Locked in",
        "content": "Actually has helped me focus"
    },
    {
        "id": 12273907996,
        "date": "2025-02-05T06:27:03-07:00",
        "user_name": "Kookadoo",
        "rating": 5,
        "title": "Most effective productivity tool I’ve tried",
        "content": "This is such a simple concept but it has really helped my ADHD brain start focused. I particularly like the focus challenges. I use it when I’m writing my novel, which is most of the day. Definitely worth giving it a try!"
    },
    {
        "id": 12239110101,
        "date": "2025-01-27T17:13:17-07:00",
        "user_name": "alwayspunnyinphilly",
        "rating": 5,
        "title": "Productivity gamified",
        "content": "I’ve been using this app since 2018 but found myself using it more than ever since they added the Focus Challenge that lets you unlock coins/crystals for completing specific tasks. This has been a game changer for me, and I feel more motivated to unlock the other trees and shrubs.  Sometimes I do wish there were other ways to sort through trees, like by type or alphabetical, however it’s manageable as is."
    },
    {
        "id": 12231125659,
        "date": "2025-01-25T17:13:57-07:00",
        "user_name": "Kait Petrie",
        "rating": 5,
        "title": "Super cute game, worth the $4!",
        "content": "I love this, it’s simple and cute and aside from paying for the app, you do not have to pay to use it! There is only one way to get more trees, and that’s by getting coins. There is only one way to get coins, and that’s by focusing and finishing challenges (and you have the option of tripling your earnings for $1 for a whole week)!!! No cheats, no shortcuts, all focus. Helps me stay off my phone and focus more on my hobbies :•)"
    },
    {
        "id": 12223671816,
        "date": "2025-01-23T21:51:11-07:00",
        "user_name": "Dr. CL Wang",
        "rating": 5,
        "title": "Fun app for adhd",
        "content": "It’s good motivating app to help me focus and feel better after being productive! Strongly recommend."
    },
    {
        "id": 12223260195,
        "date": "2025-01-23T19:00:40-07:00",
        "user_name": "mochimbun",
        "rating": 5,
        "title": "Love it",
        "content": "Although there are bugs, the app has been wonderful! It keeps me focused and motivated"
    },
    {
        "id": 12208790687,
        "date": "2025-01-20T10:53:02-07:00",
        "user_name": "orions_charge",
        "rating": 1,
        "title": "Cute idea but doesn’t work",
        "content": "I liked the idea of this app. The design is attracted and it seems like it’d be very motivating. The problem? It doesn’t block out apps. At all. I could clock right past the growing trees to do whatever I wanted on my phone and it just kept on counting time toward my “focus streak.” I did all the troubleshooting steps on their website and same thing happened. I reached out to the manufacturers via the only means I could find - a website chat - and never got a response. Requested a refund today. Back to the drawing board."
    },
    {
        "id": 12199824827,
        "date": "2025-01-18T08:14:26-07:00",
        "user_name": "Shahoo580",
        "rating": 3,
        "title": "Don’t update to new version",
        "content": "Bugs are still there.\nI updated to the new version, now focus challenge doesn’t load completely!"
    },
    {
        "id": 12192148319,
        "date": "2025-01-16T10:07:20-07:00",
        "user_name": "tytheappgiy",
        "rating": 4,
        "title": "Great app for focusing",
        "content": "Great app and has been helping me focus. I only wish there was more options for personalization."
    },
    {
        "id": 12188598356,
        "date": "2025-01-15T12:36:19-07:00",
        "user_name": "Ehsan Alipour",
        "rating": 1,
        "title": "App has become unstable recently",
        "content": "I love forest and I use it all the time. However, for the past month, the app has become unusable. When a focus ends, it takes multiple tries to get out of focus mode. The app crashes all the time when I attempt to open it. Please fix it!"
    },
    {
        "id": 12180754721,
        "date": "2025-01-13T12:52:49-07:00",
        "user_name": "RosieK620",
        "rating": 1,
        "title": "Upset with new changes",
        "content": "I’ve been a long time user of the app forest for around 4 years now when I bought the app. I feel as if the core of the app really does improve focus through creating good habits. However when I was made aware of the paid subscription update as well as the addition of AI I was very upset. I believe there are 4 big problems with these changes. 1). AI is bad for the environment and and for an app that prides itself on its environmental impacts it seems like implementing ai is just a way to be “trendy” and doesn’t follow the apps core values. On the website forest states “At Forest, we believe that better selves build a better world.” Building a better world does not include implementing AI when it is unnecessary and unhelpful. 2). Forest is a very simple app that works to break your phone addiction so adding all these bits and bobs are not helpful/useful and most of the time annoying. 3). Forest is already very buggy. For being around for years I feel as if there are big bugs that should be worked on instead of rolling out new features that no one asked for or wanted. 4). My final complaint is that I already spent the money to buy the app and asking its users to now pay for a subscription model is just another money grab. If I am asked to buy the subscription I will be switching to another app. \nOnce again forest used to be my favorite focus app but now seeing the changes coming I fear I may need to choose another option that values its users."
    },
    {
        "id": 12176737126,
        "date": "2025-01-12T12:07:04-07:00",
        "user_name": "TheRipley",
        "rating": 5,
        "title": "So fun very helpful",
        "content": "Such an entertaining way to track your focus on certain projects!"
    },
    {
        "id": 12169127205,
        "date": "2025-01-10T16:07:22-07:00",
        "user_name": "Jellyfish 🎐",
        "rating": 5,
        "title": "I love it 😍",
        "content": "It is really helpful and cute when you need to focus. Don’t wanna kill the garden. 😋"
    },
    {
        "id": 12167442406,
        "date": "2025-01-10T06:55:03-07:00",
        "user_name": "rosesforleo",
        "rating": 4,
        "title": "Great (except for some bugs)",
        "content": "I think the app is a great way to stay focused on tasks and not be tempted to pick up the phone and scroll through social media (which is a big problem for me). I also like the stats that they gather for each week and month. A great way to see how productive I have been in a day, which has been rewarding. Definitely worth the initial cost. My only criticism is the bugs that are in the app. There are times when the app just freezes on me. I will click on the plant button and nothing will happen but when I refresh and reopen the app, it shows as though the trees died even though I didn’t do anything. When I go to edit my app restrictions list, sometimes it will just pull up a blank white screen. This has been an issue that has persisted for a while now. I have restarted my phone and everything. Now I’m just using coins to get rid of the mistaken dead trees but it’s gotten more annoying especially now that I’m using the app more frequently."
    },
    {
        "id": 12167366962,
        "date": "2025-01-10T06:33:47-07:00",
        "user_name": "508:)cool user(:805",
        "rating": 4,
        "title": "Please make an account!!",
        "content": "I love this app. I have been using it for the past several months to help me focus at work, after learning about it and using it a little bit in college. I had so many tree types, and had even planted a real one. I had data from all of those months, and had started to use tree types to try and show the weather of the day/ the time of year. The app gets a bit glitchy, and sometimes won’t open. It was after one of these times that even when I was able to get the app to open, it wouldn’t go anywhere. I decided it was best to delete the app and reinstall to see if that would help. It has, but the down side was that I had not created an account. I didn’t know that that was something I had to do. I lost everything. Every tree I gained. Every achievement. I had gained trees from special events that I don’t know if I will ever be able to get again. All of them, all my data. Gone. So please, learn from me, make an account. Don’t go through the pain of starting completely over like I am going to do now. At least it’s at the start of a new year I guess."
    },
    {
        "id": 12165017771,
        "date": "2025-01-09T15:14:48-07:00",
        "user_name": "s.mmorgan",
        "rating": 4,
        "title": "Great Motivator!",
        "content": "This has been an excellent rewarding app for keeping focused on what I need to do in order to achieve my goals! Reason for docking a star: I am disappointed to hear that soon there will be a subscription requirement… I guess that’s what most apps have to do these days in order to keep making money, but it’s just another subscription I would have to keep up with and not sure it will be worth it… If subscription is required, could there be a lifetime pay-once option? Or get grandfathered in, considering I had to pay to get the app to begin with? :("
    },
    {
        "id": 12163939659,
        "date": "2025-01-09T08:57:57-07:00",
        "user_name": "ziglnigl",
        "rating": 5,
        "title": "Productivity",
        "content": "Love this app. Really helps me stay focused."
    },
    {
        "id": 12160422150,
        "date": "2025-01-08T10:40:36-07:00",
        "user_name": "Mariabloom",
        "rating": 5,
        "title": "Love it!",
        "content": "I’ve been using this app for years and it’s amazing. Huge thanks for recent update with lofi music for focus, so many great options. I love feature of planting real trees!!! Comfortable tags, different trees, everything you could wish for in app like that. 100/100"
    },
    {
        "id": 12150390821,
        "date": "2025-01-05T19:42:21-07:00",
        "user_name": "nitnatbrat",
        "rating": 5,
        "title": "love forest",
        "content": "i LOVE using forest. i’ve used it on and off for years now (just new phones etc) and it’s my go to for focus timers"
    },
    {
        "id": 12146739162,
        "date": "2025-01-04T22:14:08-07:00",
        "user_name": "Yulonjack",
        "rating": 5,
        "title": "Stay on Target!",
        "content": "In the original Star Wars, During the first run on the death star pilot of the fighter kept getting distracted. The squadron leader kept telling him “Stay on target.” “Stay on target.” As I have used for us for the last few days I keep hearing that squadron commander’s voice in my ear every time I’m tempted to shift my focus. Thank you FOREST!"
    },
    {
        "id": 12140623370,
        "date": "2025-01-03T10:03:23-07:00",
        "user_name": "AHOLT",
        "rating": 4,
        "title": "It would be 5 stars but…",
        "content": "There are a few glitches that need to be worked out. For one, I wish there was a way I could get more than double coins back, like triple or quadruple the coins. It also kicks me out of the app for seemingly no reason (only sometimes though). Now the clock won’t display on my phones Home Screen at all, and I don’t remember disabling it, so I presume that it’s a glitch. Also, and I’m pretty sure this is by design, but if you delete the memory of the app (swiping up and swiping up again), it will stop the deep focus and stop the the time on the homescreen, but I don’t think it stops the time in the app this means that I would have to wait whatever time is left to reset the time. I don’t know why these are happening, and any help would be greatly appreciated."
    },
    {
        "id": 12138292768,
        "date": "2025-01-02T20:35:19-07:00",
        "user_name": "freewillwriter",
        "rating": 5,
        "title": "Love this",
        "content": "This app helps me to stay off my phone and stay focused"
    },
    {
        "id": 12137016737,
        "date": "2025-01-02T12:51:20-07:00",
        "user_name": "Powell Review",
        "rating": 5,
        "title": "Calming Focus",
        "content": "I have had this app on my android and now my iPhone for three years. It is to date the only app I’ve ever spent money on, and I still consider money well spent. The aesthetic, calming and motivating app design have helped me focus more than any other."
    },
    {
        "id": 12133101489,
        "date": "2025-01-01T14:05:28-07:00",
        "user_name": "Thecount46",
        "rating": 2,
        "title": "Perhaps it’s the New Year…",
        "content": "I love this app. It has allowed me to focus for almost 600 hrs this year. However the last few times I’ve opened the app, it seems to shut down and also not working as fast. I’d contact them through the app, but it shuts down before I can even get to my settings.\nI’m hoping for a bug fix update soon."
    },
    {
        "id": 12108495435,
        "date": "2024-12-26T09:37:59-07:00",
        "user_name": "lilMike-",
        "rating": 3,
        "title": "Good but needs update",
        "content": "Pros: Good for focus and gamification. \nCon: not compatible with shortcuts for automation. \nNo communication from support. No 12hr clock."
    },
    {
        "id": 12107977689,
        "date": "2024-12-26T07:06:59-07:00",
        "user_name": "CRPankow",
        "rating": 5,
        "title": "Thank you!",
        "content": "I find myself going to my phone too much, and whereas Apple’s screen time controls are essentially useless (allowing indefinite 15min extensions), this app actually blocks them effectively for me and incentivizes me with adorable trees when I have just enough willpower to plant a tree but not enough to keep myself from continually trying to go to Facebook out of habit. My focus, productivity, and bedtime has been much improved.  ^_^\n\nThere have been a couple little bugs at times for me where the app doesn’t load or refresh properly, but the fact that most of the time it has kept me off my phone are well worth it, and I’m sure the team is constantly improving the app. \n\nAlso, I was elated that I could get this with a one-time purchase instead of a subscription. Those are nightmares. 💸"
    },
    {
        "id": 12104699454,
        "date": "2024-12-25T09:41:02-07:00",
        "user_name": "Misslarou",
        "rating": 5,
        "title": "Life changing",
        "content": "I love this app so much. I used to fixate on reducing my screentime but now I’m fixated on making the most out of my day and focusing on the things that matter. It’s truly life altering to operate this way and the app is beautiful, clever, thoughtful and I’m saving up for get real trees next."
    },
    {
        "id": 12095556145,
        "date": "2024-12-22T23:41:19-07:00",
        "user_name": "Archana03",
        "rating": 5,
        "title": "Best App",
        "content": "This is the best app to stay focused with!! Love it :)"
    },
    {
        "id": 12095036182,
        "date": "2024-12-22T19:30:54-07:00",
        "user_name": "jordan96539",
        "rating": 1,
        "title": "used to love it",
        "content": "really buggy… focus challenge won’t load, and i can’t stay signed in. every time i try to open the app it prompts me to sign in and then shows an error code. i can’t start or stop any timers and now im worried that i will lose all of my trees. disappointed with the updates and the lack of fixing these issues. the sign-in issue just started with the new update… do NOT update yet!"
    },
    {
        "id": 12093658166,
        "date": "2024-12-22T10:32:55-07:00",
        "user_name": "Dhhdhhrjabxbdwuahdb",
        "rating": 1,
        "title": "Used to be great",
        "content": "I used this app for years but now none of the new features load and their ‘Seekr’ won’t let me join/log in. Just another example of an app going down the tubes for new features. Uninstalling. I just want to be able to open an app and track focus."
    },
    {
        "id": 12093583060,
        "date": "2024-12-22T10:09:07-07:00",
        "user_name": "Bird hottie",
        "rating": 1,
        "title": "Horrible",
        "content": "This app the current focus challenge never loads no one from support ever contacts you and they never fix anything. I’m finding a new app to use."
    },
    {
        "id": 12072826066,
        "date": "2024-12-16T23:19:16-07:00",
        "user_name": "6!38hrbcu",
        "rating": 5,
        "title": "The most Productivity app",
        "content": "I used to have a hard time focusing on what’s on my hands, like studying and practicing the piano. With the help of the Forest team, I’ve form the habit of concentrating on what’s going on. The cute trees design and interfaces also indicate the hard work the team had done. Whenever I clip into my forest, I have a sense of accomplishment and want to plant even more. \nThank you Forest!"
    },
    {
        "id": 12072692420,
        "date": "2024-12-16T22:12:13-07:00",
        "user_name": "J12372",
        "rating": 5,
        "title": "Best Productivity App",
        "content": "I’ve been using this since 2019. it’s the best app to use to be productive while still having fun while you work. Best focus app out there by far."
    },
    {
        "id": 12048171047,
        "date": "2024-12-10T10:25:43-07:00",
        "user_name": "didyoga",
        "rating": 2,
        "title": "Not blocking apps",
        "content": "I just paid $4 to download this and it’s not blocking me from using other apps at all. I have it in deep focus mode, enabled it to track other apps, ensured my other apps aren’t set to always allow on my phone, but still nothing happens, rendering this app entirely useless, since that’s the only point of it. In fact, the only app I can’t use while in deep focus mode is the Forest app!!"
    },
    {
        "id": 12042182615,
        "date": "2024-12-08T19:06:06-07:00",
        "user_name": "ZMZ92",
        "rating": 5,
        "title": "Awesome pomodoro alternative",
        "content": "This app is absolutely awesome and I like it at. I utilize my focus and get rewarded that I’m doing something good such as planting a tree."
    },
    {
        "id": 12038324231,
        "date": "2024-12-07T18:54:40-07:00",
        "user_name": "BourbonSharknado",
        "rating": 3,
        "title": "An OK pomodoro app with poor Apple Watch support",
        "content": "Update 12/2024: the app has become very unstable, with extremely long loading times, frequent crashes, and the inability to start sessions. \n\nSome frustrating bugs remain unfixed. One is example is that if you start a session with deep focus enabled, and immediately cancel it, your apps will still be blocked.\n\nWould be nice after a year of planting trees to be able to zoom in on the forest instead of viewing at an extreme distance.\n\nThe most frustrating aspect of Forest is the limited Apple Watch support. If users could start focus sessions without using their phones, they would look at their phones less. Which is the whole point of using the app. But that feature isn’t available. Instead, all you can do is look at your forest.\n\nOther annoyances are some questionable UI choices, like the annoying pop up on the view Forest screen that can’t be turned off. \n\nBalanced against this is the clever tree planting system which gives users a stake in completing through on their focus sessions. Also valuable are the statistics, competitions, and ability to acquire more flora through sweat equity. These features make Forest one of the best pomodor apps. It’s just unfortunate to miss on something as basic and useful as Apple Watch support."
    },
    {
        "id": 12034001171,
        "date": "2024-12-06T16:30:33-07:00",
        "user_name": "Eggtart girl",
        "rating": 3,
        "title": "Bugs with newly released features",
        "content": "This is a great app, but the focus challenge is extremely broken even for Beta release. There are also some issues with the “planting tree together” function. I am hoping a fix gets rolled out soon to address all the glitches\n\nIf you are using the app for just base purposes (planting trees solo and focusing) it works well"
    },
    {
        "id": 12030254465,
        "date": "2024-12-05T16:34:42-07:00",
        "user_name": "Aphid user",
        "rating": 5,
        "title": "Love the Focus Challenge! Keep it!",
        "content": "I’m not sure I’ve written a review for an app but I feel passionately enough to write this. \nFirst I’ve been a forest user for 7 years now. I’ve only really started relying on it in the past 2 years but I’ve always enjoyed how the app functions. The UI is easy to navigate, it’s easy to designate apps that won’t be turned off. Getting coins for each focus session to unlock new trees is always a treat. And it’s really fun to do longer sessions to grow bigger trees/plants! \n\nBut I think that this focus challenge mode will be a game changer for me. It’s enticing me to want to use the app every single day even when I may not need to focus. I love that it gives you crystals if you do a particularly hard challenge, which are otherwise locked behind a paywall. And I love that the daily challenges change and are building toward a reward at the end of the month! What a GREAT ADDITION! \nPlease, keep it! DON’T change ANYTHING, particularly the crystals cause that’s just corporate scumminess. We’re only getting five and I’m SO OKAY with that. \nBut in general, keep the challenges, it inspires attention to what you’re planting and can entice the user to get new trees. GREAT ADDITION again, continue doing great things!"
    },
    {
        "id": 12022681817,
        "date": "2024-12-03T15:58:37-07:00",
        "user_name": "Allieflores12",
        "rating": 5,
        "title": "College Student Approved",
        "content": "Helps me focus so well! I absolutely love it and the trees are so cute!"
    },
    {
        "id": 12022626151,
        "date": "2024-12-03T15:34:41-07:00",
        "user_name": "mesaysno",
        "rating": 5,
        "title": "Love",
        "content": "I focus better on"
    },
    {
        "id": 12017823693,
        "date": "2024-12-02T08:57:22-07:00",
        "user_name": "Becktrabeck",
        "rating": 5,
        "title": "Really helpful so far!",
        "content": "I love trees and so far this has been a great way to keep me focused at work."
    },
    {
        "id": 12014273120,
        "date": "2024-12-01T10:22:18-07:00",
        "user_name": "Liz🥀🕸️🌙",
        "rating": 5,
        "title": "Best Productivity App",
        "content": "I started using this app in high school and I am now in law school. It truly helps keep you focused. I am motivated by not killing my tree and to continue planting so I can get coins to buy more trees. I love how you can plant real trees. I really like the focus challenge they are currently doing; I like having a different way to get a new species and it provides an outside motivation to get your work done. I love how in December it turns to a winter theme, but you do have the option to turn that off. I like being able to choose between stopwatch and timer because sometimes I don’t know how long I want to work for but I don’t want to kill my tree if I need to work for less than I set the timer for. I also think it is great you can customize your allow list. I also love being able to look at your forest as days, weeks, months, or years. It is interesting going back to see what I was focusing on, what months I focus the most, and even what years I was most focused. I have never had a problem with this app! I think it would be cool if different seasons and holidays get decorations like December does. For example, spider webs and bats for October or sparkles and hearts for Valentine’s Day. I also would love more species to buy or win through future focus challenges. I wonder if you could add a pomodoro timer to the app so you can have scheduled breaks."
    },
    {
        "id": 12005527370,
        "date": "2024-11-29T07:36:24-07:00",
        "user_name": "Kammm<3",
        "rating": 5,
        "title": "Extremely Motivating",
        "content": "Forest is exactly what I was looking for. It keeps me on target and eliminates my phone as a distraction. It’s motivating to want to keep the little trees and plants alive, and it’s always fun to change to a different type of plant or flower. \n\nThe best part (and most motivating thing to me) is working to plant a real tree. Knowing that my focus time can actually be spent on something that makes the real world better really encourages me to keep pushing. \n\nI would recommend Forest to anyone and everyone."
    },
    {
        "id": 11991799546,
        "date": "2024-11-25T14:08:24-07:00",
        "user_name": "Rugeby",
        "rating": 5,
        "title": "Great App",
        "content": "Help you focus! I love it"
    },
    {
        "id": 11982356374,
        "date": "2024-11-23T04:30:43-07:00",
        "user_name": "chbl",
        "rating": 4,
        "title": "Awesome but be careful",
        "content": "For some reason the app stopped blocking other apps during focus time recently, defeating its purpose. After reinstalling, all my unlocked trees and records of countless hours of focus were gone. Have to start all over again.."
    },
    {
        "id": 11980660670,
        "date": "2024-11-22T17:12:49-07:00",
        "user_name": "N1l4",
        "rating": 4,
        "title": "Great tool for ADHD management. Almost perfect!",
        "content": "I love Forest’s easy to navigate interface and the variety of tree species there are to grow. It’s my favorite Pomodoro app. The one (kind of big) criticism I have is that there is no way to select which variation of a tree species you grow. It’s better for me to set my day into smaller chunks of focus time, but that means I never get to see the other variations of trees available when setting the timer to 60–120+ minutes. It’s really disappointing; it takes kind of a long time to save enough coins for them, only to never/rarely get to grow anything past the “young”, less robust tree."
    },
    {
        "id": 11964885624,
        "date": "2024-11-18T10:07:56-07:00",
        "user_name": "Glagerberg",
        "rating": 4,
        "title": "Helpful app.",
        "content": "Great for trying to focus on studying!"
    },
    {
        "id": 11964005461,
        "date": "2024-11-18T05:18:10-07:00",
        "user_name": "mayah skye",
        "rating": 5,
        "title": "Best focus app!",
        "content": "Best focus app! Uses game theory to keep you coming back for more and becoming better at focusing!"
    },
    {
        "id": 11956622262,
        "date": "2024-11-16T06:13:31-07:00",
        "user_name": "disappointed student :(",
        "rating": 2,
        "title": "Great App but Very Glitchy",
        "content": "I love this app, and have been using it for years, but the deep focus mode is broken. Hopefully there is an update soon that fixes it!"
    },
    {
        "id": 11951494834,
        "date": "2024-11-14T21:59:48-07:00",
        "user_name": "ad-hoc-niner",
        "rating": 1,
        "title": "App Stopped Working",
        "content": "Forest almost never gets updates or new features. It would be great if a break timer would start automatically when a focus session is completed and to have the ability to set different length breaks based on how many sessions have been completed. However, the usability of the app needs to be fixed ASAP. I can’t use the app now. It either crashes when I open it, opens but is frozen, or doesn’t start a session but still kills a tree. It is a little frustrating that the app all of a sudden stopped working and that I have to use coins to remove planting records that I didn’t even fail."
    },
    {
        "id": 11946898298,
        "date": "2024-11-13T15:16:24-07:00",
        "user_name": "Rudy22!",
        "rating": 5,
        "title": "Great!",
        "content": "Perfect for focusing! Easy to use!"
    },
    {
        "id": 11940435404,
        "date": "2024-11-11T21:14:15-07:00",
        "user_name": "Rice cooker4",
        "rating": 5,
        "title": "Love it!",
        "content": "Haven’t used the app for long, but it has helped me focus."
    },
    {
        "id": 11930565571,
        "date": "2024-11-09T07:11:27-07:00",
        "user_name": "Spartacus1120",
        "rating": 5,
        "title": "Love it to pieces",
        "content": "Awesome app, does wonders for my adhd"
    },
    {
        "id": 11927413450,
        "date": "2024-11-08T11:09:13-07:00",
        "user_name": "Juliasofia02",
        "rating": 5,
        "title": "Amazing",
        "content": "Really great tool to focus"
    },
    {
        "id": 11924241789,
        "date": "2024-11-07T14:37:06-07:00",
        "user_name": "JohnGonz94",
        "rating": 5,
        "title": "Addicting !!!",
        "content": "Ever since this app, I've read numerous books. It's made me focus on the things that matter.being able to view how much work I've put in (with the amount of trees I've planted) is quite appealing. Thanks guys, you've come up with an amazing idea!"
    },
    {
        "id": 11920485903,
        "date": "2024-11-06T14:01:07-07:00",
        "user_name": "Nosroc13",
        "rating": 5,
        "title": "Very useful",
        "content": "Makes focusing more fun which makes it easier, allowing you to be more productive."
    },
    {
        "id": 11919151649,
        "date": "2024-11-06T06:14:05-07:00",
        "user_name": "Meghs123",
        "rating": 1,
        "title": "Not working correctly",
        "content": "I have updated the app to the most current version, deleted the app, downloaded it again, all to no avail. The app allow list does not work. Specifically finance and banking apps. If you try and allow your banking app as one to be used in focus mode the app shuts down. What’s the point? Useless."
    },
    {
        "id": 11916827944,
        "date": "2024-11-05T14:01:33-07:00",
        "user_name": "Nicoya_baybee",
        "rating": 5,
        "title": "Amazing",
        "content": "This app has helped me a lot in making sure that I study and focus on the task at hand. What I really like is after so many points you can help plant real trees and all the other “trees” you can gain is fun. you get to study, gain a tree and plant a tree."
    },
    {
        "id": 11916586652,
        "date": "2024-11-05T12:28:44-07:00",
        "user_name": "ceckye",
        "rating": 1,
        "title": "Doesn’t work anymore",
        "content": "Used to love this app but it has stopped working for me. It no longer tracks when I leave the app (writing this as my tree is growing in deep focus mode), and I can grow trees without staying in the app at all, which defeats the entire purpose of the app. I hope the devs fix this bug because this app was really useful to me before this!"
    },
    {
        "id": 11891920010,
        "date": "2024-10-30T05:57:38-07:00",
        "user_name": "Kindren",
        "rating": 5,
        "title": "So helpful",
        "content": "Helps me stay focused, and it’s motivating!"
    },
    {
        "id": 11889566283,
        "date": "2024-10-29T14:07:01-07:00",
        "user_name": "alexson28",
        "rating": 2,
        "title": "Deep focus - trees won’t die",
        "content": "When navigating to other apps and using my phone under deep focus mode I’m expecting my plants to die. This hasn’t been the case."
    },
    {
        "id": 11888274250,
        "date": "2024-10-29T06:53:12-07:00",
        "user_name": "Pasta_Brett",
        "rating": 5,
        "title": "Great app",
        "content": "Helps me keep focused and be excited to do work rather than dread it"
    },
    {
        "id": 11867787219,
        "date": "2024-10-23T19:04:56-07:00",
        "user_name": "Dom220f",
        "rating": 5,
        "title": "Best focus app on the market.",
        "content": "Previously had used this app on my android phone. I was hesitant to pay for this app when I switched to iPhone. Before getting this app I tried a variety a bells and whistles but they all fell apart. This is the best focus app ever! Plus they keep giving cool trees and there are special events which you can only earn rewards by putting in the time."
    },
    {
        "id": 11865897857,
        "date": "2024-10-23T07:07:21-07:00",
        "user_name": "michael.p.k",
        "rating": 2,
        "title": "Fix the log outs for 5/5",
        "content": "Great concept but won’t stay logged in. Nothing kills productivity like having to log in, sometimes multiple times, before each 20 minute focus sprint"
    },
    {
        "id": 11860230464,
        "date": "2024-10-21T16:08:09-07:00",
        "user_name": "Wolfang07",
        "rating": 3,
        "title": "Great, but why the micro transactions?",
        "content": "It's amazing for keeping me off my phone, but do we seriously need micro transactions in a PAID app? It also takes away from the actual point of the app, which is to keep you focused, not get you sidetracked on some new tree skin. Would be 5 stars if not for this hypocritical behavior"
    },
    {
        "id": 11841676888,
        "date": "2024-10-16T14:45:17-07:00",
        "user_name": "jonahsince_05",
        "rating": 4,
        "title": "Works great",
        "content": "having adhd i like being able to see the timer it gives me a sense of accomplishment"
    },
    {
        "id": 11840346991,
        "date": "2024-10-16T06:47:19-07:00",
        "user_name": "Roman T. 24",
        "rating": 5,
        "title": "Improved time spending",
        "content": "Heps me focus very we"
    },
    {
        "id": 11831692153,
        "date": "2024-10-13T20:44:54-07:00",
        "user_name": "Livia35",
        "rating": 3,
        "title": "Fun but weirdly not helpful",
        "content": "If you have no willpower of your own this will be a tough focus app. It doesn’t actually penalize you for using your device."
    },
    {
        "id": 11823916850,
        "date": "2024-10-11T20:03:12-07:00",
        "user_name": "Tulsip25",
        "rating": 5,
        "title": "Helps me prioritize my tasks over phone distractions",
        "content": "I love this app! I can customize the time settings and focus on my tasks"
    },
    {
        "id": 11816572385,
        "date": "2024-10-09T18:49:11-07:00",
        "user_name": "CorbinTLan",
        "rating": 5,
        "title": "Very helpful",
        "content": "I look forward to planting trees while i study! It give me real time to focus because my phone is locked technically. Well worth it!"
    },
    {
        "id": 11812585505,
        "date": "2024-10-08T15:44:57-07:00",
        "user_name": "Cpatel5",
        "rating": 5,
        "title": "Love this app",
        "content": "This app allows me to stay focused and also connect with my friends to group study. I love it"
    },
    {
        "id": 11811782549,
        "date": "2024-10-08T10:19:32-07:00",
        "user_name": "elephantbot",
        "rating": 1,
        "title": "Deep Focus not working",
        "content": "I really love the app - just recently though deep focus isn’t blocking use of apps so when I forget and go to open an app not on my allow list, it kills my tree growth progress because it’s not blocked off. I’ve updated the app l, checked online forums and the FAQ and still have the same issue.\n\nI am also a little cynical in my belief that this was on purpose because I was close to being able to plant another real tree"
    },
    {
        "id": 11808760534,
        "date": "2024-10-07T13:34:13-07:00",
        "user_name": "Cam453210",
        "rating": 5,
        "title": "Love it",
        "content": "It’s really hard for me to be focused and I this app has helped me a lot."
    },
    {
        "id": 11794094267,
        "date": "2024-10-03T14:40:12-07:00",
        "user_name": "Emme Leah Hernandez",
        "rating": 5,
        "title": "This app is awesome",
        "content": "I am a student and staying focused while trying to study can be hard I love forest because this amazing app makes me stay focused and on task"
    }
]